--迭代函数，用于计算技能熟练度
--具体方法：
--根据1级熟练度，升级加速度，级数，重复伤害次数，范围，计算出相应等级熟练度
-- SkillExp(i) = Exp1*a^(i-1)*time*range
function SkillExpFunc(Exp0,a,Level,Time,Range)
	return floor(Exp0*(a^(Level-1))*Time*Range/2)
end

SKILLS={
	--武当
	nulei_zhi={ --怒雷指
		lightingdamage_v={
			[1]={{1,1},{20,5}},
			[3]={{1,1},{20,75}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-600}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		seriesdame={{{1,1},{20,10}},{{1,4},{2,4}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		addskilldame1={{{1,382},{20,382}},{{1,1},{20,110}}},
		addskilldame2={{{1,165},{20,165}},{{1,1},{20,35}}},
			missle_speed_v={{{1,20},{20,24}}},
		skill_attackradius={{{1,320},{20,384}}},
		skill_cost_v={{{1,15},{20,20}}},
changecamp_b={{{1,0},{20,5},{21,5}}},
	},
	wudang_jianfa ={ --武当剑法
		addphysicsdamage_p={{{1,25},{20,215}},{{1,-1},{2,-1}},{{1,0},{2,0}}},
		attackratingenhance_p={{{1,15},{20,72}},{{1,-1},{2,-1}}},
		deadlystrikeenhance_p={{{1,6},{20,25,Conic}},{{1,-1},{2,-1}}},
knockbackenhance_p={{{1,0},{20,5},{21,5}}}
	},
	wudang_quanfa={ --武当拳法
			manashield_p={{{1,-5},{15,-15},{19,-20},{20,-25},{21,-25}},{{1,-1},{20,-1}}},
		earthskill_v={{{1,20},{15,250},{20,915}},{{1,-1},{2,-1}}},
knockbackenhance_p={{{1,0},{20,5},{21,5}}}
	},
	canghai_mingyue={ --沧海明月
		physicsenhance_p={{{1,5},{20,75}}},
		seriesdame={{{1,1},{20,10}},{{1,4},{2,4}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		lightingdamage_v={
			[1]={{1,6},{20,12},{56,100}},
			[3]={{1,6},{20,115},{56,150}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-550}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		addskilldame1={{{1,380},{20,380}},{{1,1},{20,60}}},
		addskilldame2={{{1,267},{20,267}},{{1,1},{20,35}}},
		missle_speed_v={{{1,20},{20,24}}},
		skill_attackradius={{{1,320},{20,384}}},
		skill_cost_v={{{1,0},{20,0}}},
changecamp_b={{{1,0},{20,5},{21,5}}},
	},
	zuowang_wuwo={ --坐望无我
		 manashield_p={{{1,25},{5,75},{20,99},{21,100}},{{1,18*360},{20,18*360}}},
		skill_cost_v={{{1,60},{20,160}}}
	},
	jianfei_jingtian={ --剑飞惊天
		seriesdame={{{1,5},{20,30}},{{1,4},{2,4}}},
		physicsenhance_p={{{1,20},{20,115}}},
skill_eventskilllevel={{{1,1},{2,2}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{59,25},{60,0}},
			[3]={{1,0},{2,0}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-800}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		lightingdamage_v={
			[1]={{1,10},{20,24}},
			[3]={{1,10},{20,225}}
		},
		addskilldame1={{{1,162},{20,162}},{{1,1},{20,268}}},		
		skill_attackradius={{{1,384},{20,416}}},
		skill_cost_v={{{1,10},{20,25}}},
slowmissle_b={{{1,0},{20,3},{21,3}}}
	},
tang4vd={ --剑飞惊天
		seriesdame={{{1,150},{50,150}},{{1,4},{2,4}}},
		physicsenhance_p={{{1,1},{25,1000},{49,8000},{50,10515},{55,20515}}},
		lightingdamage_v={
			[1]={{1,50},{25,2000},{45,5500},{55,6000}},
			[3]={{1,100},{25,2225},{45,5000},{55,8000}}
		},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{59,25},{60,25}},
			[3]={{1,0},{2,0}}
		},
	
		skill_attackradius={{{1,384},{20,416}}},
		skill_cost_v={{{1,0},{20,0}}}
	},
	qingxing_zhen={ --七星阵
		attackratingenhance_p={{{1,24},{20,450}},{{1,18},{20,18},{51,18},{52,1080},{53,1080}}},
		adddefense_v={{{1,97},{20,800}},{{1,18},{20,18}}},
skill_eventskilllevel={{{1,1},{2,2}}},
	},
	tiyun_zong={ --梯云纵
		fastwalkrun_p={{{1,18},{20,60}},{{1,-1},{20,-1}}},
	},
	boji_erfu={ --剥及而复
		seriesdame={{{1,5},{20,30}},{{1,4},{2,4}}},
skill_eventskilllevel={{{1,1},{50,50},{51,0},{52,0}}},
		lightingdamage_v={
			[1]={{1,5},{20,8}},
			[3]={{1,5},{20,175}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-850}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		stun_p={{{1,20},{20,55}},{{1,1},{20,20},{21,20}}},
		addskilldame1={{{1,382},{20,382}},{{1,1},{20,120}}},		
			skill_attackradius={{{1,384},{20,416}}},
		skill_cost_v={{{1,60},{20,70}}},
slowmissle_b={{{1,0},{20,3},{21,3}}}
	},
	wuwo_wujian={ --无我无剑
		lightingdamage_v={
			[1]={{1,1},{20,5}},
			[3]={{1,5},{20,752}}
		},
		seriesdame={{{1,10},{20,50}},{{1,4},{2,4}}},
skill_eventskilllevel={{{1,1},{50,50},{51,0},{52,0}}},
		addskilldame1={{{1,382},{20,382}},{{1,1},{20,130}}},
	lifereplenish_v={{{1,0},{60,0},{61,-1300}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		stun_p={{{1,5},{20,20}},{{1,1},{20,10},{21,10}}},
		skill_misslenum_v={{{1,1},{20,8},{21,8}}},
		missle_speed_v={{{1,28},{20,30},{21,30}}},
		skill_attackradius={{{1,448},{20,512},{21,512}}},
		skill_cost_v={{{1,70},{20,130}}},
slowmissle_b={{{1,0},{20,7},{21,7}}}
	},
	taiji_shengong={ --太极神功
		attackspeed_v={{{1,21},{30,65}},{{1,-1},{30,-1}}},
		castspeed_v={{{1,21},{30,65}},{{1,-1},{30,-1}}},
		addlightingdamage_v={{{1,20},{20,275}},{{1,-1},{2,-1}}},
		manamax_p={{{1,35},{30,245}},{{1,-1},{2,-1}}},
		manareplenish_v={{{1,1},{30,15}},{{1,-1},{2,-1}}},
		deadlystrikeenhance_p={{{1,5},{30,25}},{{1,-1},{2,-1}}},
		addphysicsdamage_p={{{1,10},{30,55}},{{1,-1},{2,-1}},{{1,6},{2,6}}},
			lightingenhance_p={{{1,16},{30,100}},{{1,-1},{2,-1}}}
	},
	sanhuan_taoyue={ --三环套月
		seriesdame={{{1,10},{20,50},{20,52}},{{1,4},{2,4}}},
skill_eventskilllevel={{{1,1},{50,50},{51,0},{52,0}}},
		physicsenhance_p={{{1,20},{20,231}}},
		attackrating_p={{{1,65},{20,345}}},
		stealmanaenhance_p={{{1,1},{20,5}}},
		deadlystrike_p={{{1,16},{20,25}}},
		stun_p={{{1,1},{20,10}},{{1,1},{20,10},{21,10}}},
lifereplenish_v={{{1,0},{60,0},{61,-1500}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		lightingdamage_v={
			[1]={{1,6},{20,20}},
			[3]={{1,6},{20,386}}
		},
		addskilldame1={{{1,380},{20,380}},{{1,1},{20,125}}},
		missle_speed_v={{{1,26},{20,26}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_attackradius={{{1,78},{20,78}}},
		skill_cost_v={{{1,15},{20,40}}},
slowmissle_b={{{1,0},{20,7},{21,7}}}
	},
tang3vd={ --三环套月
		seriesdame={{{1,150},{50,150}},{{1,4},{2,4}}},
		physicsenhance_p={{{1,20},{25,50},{40,1000},{50,3000},{55,5000}}},
		attackrating_p={{{1,65},{20,345}}},
		stealmanaenhance_p={{{1,1},{20,5}}},
		deadlystrike_p={{{1,16},{20,25}}},
skill_eventskilllevel={{{1,1},{34,0},{35,35},{50,50}}},
		stun_p={{{1,1},{20,30}},{{1,1},{20,10},{21,10}}},
		lightingdamage_v={
			[1]={{1,1000},{50,2000}},
			[3]={{1,1000},{50,2000}}
		},
			missle_speed_v={{{1,26},{20,26}}},
		missle_lifetime_v={{{1,4},{20,4}}},
skill_misslenum_v={{{1,1},{25,3},{49,5},{50,8},{51,8}}},
		skill_attackradius={{{1,78},{20,78}}},
		skill_cost_v={{{1,0},{20,0}}}
	},
	tiandi_wuji={ --天地无极
		seriesdame={{{1,20},{15,20},{20,60},{21,62}},{{1,4},{2,4}}},
		--stun_p={{{1,10},{20,20},{21,20}},{{1,1},{20,6},{21,6}}},
		stun_p={{{1,10},{20,30},{21,30}},{{1,1},{20,6},{21,6}}},
			skilllevelexp={{{1,22*9},{2,55*9},{3,110*9},{4,220*9},{5,440*9},{6,880*9},{7,1320*9},{8,1870*9},{9,2530*9},{10,3850*9},{11,5610*9},{12,7920*9},{13,10450*9},{14,14410*9},{15,20570*9},{16,26840*9},{17,39270*9},{18,56320*9},{19,108900*9},{20,0}},{{1,382},{20,382}},{{1,191},{1,191}}},
		skill_eventskilllevel={{{1,0},{10,0},{11,11},{20,20}}},
		stunenhance_p={{{1,0},{10,1},{20,5},{21,5}}},
lifereplenish_v={{{1,0},{60,0},{61,-3500},{62,-5500}},{{1,6*18},{60,6*18},{61,9},{62,9}}},
lightingres_p={{{1,-1},{20,-20},{30,-40},{31,-40}},{{1,18},{2,18}}},
vitality_v={{{1,0},{20,0},{21,-50},{30,-200},{59,0},{60,-150}},{{1,6*18},{60,6*18},{61,9},{62,9}}},
stuntimereduce_p={{{1,0},{20,0},{21,-10},{30,-40},{59,0},{60,-20}},{{1,6*18},{60,6*18},{61,9},{62,9}}},
lightingdamage_v={
			[1]={{1,5},{20,8}},
			[3]={{1,5},{15,150},{20,350}}
		},
		missle_lifetime_v={{{1,8},{20,20},{21,20}}},
		skill_cost_v={{{1,60},{20,150}}},
	},
batkiemvocuc={ --天地无极
		seriesdame={{{1,50},{50,150}},{{1,4},{2,4}}},
		lightingdamage_v={
			[1]={{1,5},{20,5000},{49,20000},{50,30000},{55,50000}},
			[3]={{1,5},{20,5000},{49,20000},{50,30000},{55,50000}}
		},
		skill_attackradius={{{1,448},{20,512},{21,512}}},
skill_eventskilllevel={{{1,0},{24,0},{25,25},{50,50}}},
		missle_lifetime_v={{{1,8},{20,20},{21,20}}},
skill_flyevent={{{1,0},{35,1}}},
		stun_p={{{1,10},{20,20},{21,21}},{{1,1},{20,8},{50,36}}},
skill_startevent={{{1,0},{50,1}}},
		skill_cost_v={{{1,0},{20,0}}},
	},
	jianqi_zongheng={ --剑气纵横
		seriesdame={{{1,20},{20,60}},{{1,4},{2,4}}},
		lightingdamage_v={
			[1]={{1,12},{20,60}},
			[3]={{1,58},{20,610}}
		},
		skill_eventskilllevel={{{1,1},{20,20}}},
		skill_collideevent={
			[1]={{1,0},{10,0},{10,1},{20,1}},
			[3]={{1,366},{20,366}}
		},
		skill_showevent={{{1,0},{10,0},{10,4},{20,4}}},
	},
tang2vd={ --剑气纵横
		seriesdame={{{1,150},{50,150}},{{1,4},{2,4}}},
		lightingdamage_v={
			[1]={{1,100},{25,1000},{40,5000},{50,10000},{55,20000}},
			[3]={{1,100},{25,1000},{40,5000},{50,10000},{55,20000}}
		},
		skill_eventskilllevel={{{1,1},{20,20}}},
		skill_collideevent={
			[1]={{1,0},{10,0},{10,1},{20,1}},
			[3]={{1,366},{20,366}}
		},
		skill_showevent={{{1,0},{10,0},{10,4},{20,4}}},
	},
	taiji_wuyi={ --太极无意
		seriesdame={{{1,20},{20,60}},{{1,4},{2,4}}},
		stun_p={{{1,20},{20,20}},{{1,9},{20,9}}},
		skill_eventskilllevel={{{1,1},{20,20}}},
		skill_vanishedevent={
			[1]={{1,0},{15,0},{15,1},{20,1}},
			[3]={{1,377},{20,377}}
		},
		skill_showevent={{{1,0},{15,0},{15,8},{20,8}}},
	},
	nulei_lianhuanji={ --怒雷连环击
		seriesdame={{{1,20},{20,60}},{{1,4},{2,4}}},
		lightingdamage_v={
			[1]={{1,12},{20,60}},
			[3]={{1,58},{20,610}}
		},
	},
	renjian_heyi={ --人剑合一
		physicsenhance_p={{{1,8},{15,80},{20,194}}},
				skilllevelexp={{{1,22*9},{2,55*9},{3,110*9},{4,220*9},{5,440*9},{6,880*9},{7,1320*9},{8,1870*9},{9,2530*9},{10,3850*9},{11,5610*9},{12,7920*9},{13,10450*9},{14,14410*9},{15,20570*9},{16,26840*9},{17,39270*9},{18,56320*9},{19,108900*9},{20,0}},{{1,380},{20,380}},{{1,192},{1,192}}},

		seriesdame={{{1,20},{15,20},{20,60},{21,62}},{{1,4},{2,4}}},
lightingres_p={{{1,-1},{20,-15},{30,-30},{31,-30}},{{1,18},{2,18}}},
physicsres_p={{{1,-1},{20,-15},{30,-30},{31,-30}},{{1,18},{2,18}}},
		lightingdamage_v={
			[1]={{1,12},{20,35}},
			[3]={{1,12},{15,100},{20,268}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-3000},{62,-5000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{50,0},{51,25}},
			[3]={{1,0},{2,0}}
		},
		attackrating_p={{{1,7},{20,345}}},
		stealmana_p={{{1,1},{20,5}}},
		deadlystrike_p={{{1,16},{20,25}}},
		missle_speed_v={{{1,30},{20,30}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		stunenhance_p={{{1,0},{10,1},{20,5},{21,5}}},
		skill_cost_v={{{1,35},{20,60}}},
		skill_eventskilllevel={{{1,0},{10,0},{11,11},{20,20}}},
		skill_collideevent={
			[1]={{1,0},{15,0},{16,15},{20,20}},
			[3]={{1,162},{20,162}}
		},
		skill_showevent={{{1,0},{10,0},{10,1},{15,1},{15,5},{20,5}}},
	},
	xuanyi_wuxiang={ --玄一无象
		seriesdame={{{1,20},{20,60}},{{1,4},{2,4}}},
		lightingdamage_v={
			[1]={{1,1},{10,10},{20,27},{30,54},{51,27}},
			[3]={{1,10},{10,100},{20,268},{30,536},{51,268}}
		},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{50,0},{51,25}},
			[3]={{1,0},{2,0}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-4000},{62,-6000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
strength_v={{{1,0},{20,0},{21,-30},{30,-150},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
dexterity_v={{{1,0},{20,0},{21,-30},{30,-150},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
vitality_v={{{1,0},{20,0},{21,-30},{30,-150},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
energy_v={{{1,0},{20,0},{21,-30},{30,-150},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
	},
	taiji_jianyi={ --太极剑意
		stun_p={{{1,5},{30,25},{51,25}},{{1,9},{30,18},{31,18}}},
skill_eventskilllevel={{{1,1},{2,2}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{50,0},{51,25}},
			[3]={{1,0},{2,0}}
		},
	},

ttvdq1={ --天地无极
		seriesdame={{{1,0},{10,0},{11,20},{20,60},{21,62}},{{1,4},{2,4}}},
		stun_p={{{1,10},{30,25}},{{1,9},{30,18},{31,18}}},
		skill_eventskilllevel={{{1,0},{10,0},{11,11},{20,20}}},
		stunenhance_p={{{1,0},{10,1},{20,5},{21,5}}},
lifereplenish_v={{{1,0},{60,0},{61,-3500},{62,-5500}},{{1,6*18},{60,6*18},{61,9},{62,9}}},
lightingres_p={{{1,-2},{20,-30},{30,-60},{31,-60}},{{1,18},{2,18}}},
vitality_v={{{1,0},{20,0},{21,-50},{30,-200},{59,0},{60,-150}},{{1,6*18},{60,6*18},{61,9},{62,9}}},
stuntimereduce_p={{{1,0},{20,0},{21,-10},{30,-40},{59,0},{60,-20}},{{1,6*18},{60,6*18},{61,9},{62,9}}},
lightingdamage_v={
			[1]={{1,5*3/2},{10,8*3/2},{20,39*3/2},{30,78*3/2},{53,250},{59,250},{60,330},{61,0},{62,0}},
			[3]={{1,5*3/2},{10,350*3/2},{20,1610*3/2},{30,3220*3/2},{53,250},{59,260},{60,340},{61,0},{62,0}}
		},
		missle_lifetime_v={{{1,8},{20,20},{21,20}}},
		skill_cost_v={{{1,60},{20,150}}},
	},

	wudang120={ --武当120级技能
		
		freezetimereduce_p={{{1,1},{20,30},{21,31}},{{1,-1},{2,-1}}},
		castspeed_v={{{1,2},{20,40},{21,45}},{{1,-1},{2,-1}}},
		
	},
       skill120={
                skill_cost_v={{{1,80},{20,160},{21,160}}},
                skill_mintimepercast_v={{{1,30*18},{20,15*18},{21,15*18}},{{1,30*18},{20,15*18},{21,15*18}}},
		skilllevelexp={{{1,18},{2,45},{3,90},{4,180},{5,360},{6,720},{7,1080},{8,1530},{9,2070},{10,3150},{11,4590},{12,6480},{13,8550},{14,11790},{15,16830},{16,21960},{17,32130},{18,46080},{19,89100},{20,89100},{21,89100}},{{1,0},{20,0}},{{1,140},{1,140}}},
                nstatus_p={{{1,35},{20,85},{21,85}},{{1,18},{20,3*18},{21,3*18}},{{1,480},{20,480}}},
                
	},
        skill120b={
                stateskilltime={{{1,1},{20,1}},{{1,18},{20,3*18},{21,3*18}}},
	},
	wudang150={ --150级技能
		skill_cost_v={{{1,100},{20,200},{21,220}},{{1,-1},{2,-1}}},
		damagetomana_p={{{1,10},{20,50},{21,55}},{{1,18*120},{20,18*120}}},
		attackratingenhance_v={{{1,20000},{20,200000}},{{1,18*120},{20,18*120}}},
                stealmanaenhance_p={{{1,1},{20,50},{21,55}},{{1,18*120},{20,18*120}}},
                addskilldame2={{{1,750},{20,500000},{21,550000}},{{1,18*120},{20,18*120}}},
                castspeed_v={{{1,-1},{20,-20},{21,-21}},{{1,18*10},{20,18*10}}}           
	},
}
-----------------------------------------------
--Create by yfeng 2004-05-20
-----------------------------------------------

-----------------------------------------------
--根据2个点，求线形函数f(x)=k*x+b
--y= (y2-y1)*(x-x1)/(x2-x1)+y1
--当x2=x1, 有x=c,该直线是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：
function Line(x,x1,y1,x2,y2)
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--根据2个点，求2次形函数f(x)=a*x2+c
--y= (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
--当x1或者x2 < 0 ,y =0
--当x2=x1, 有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Conic(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then 
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
end

-----------------------------------------------
--根据2个点，求-2次形函数f(x)=a*sqrt(x2)+c
--y=(y2-y1)*x/(sqrt(x2)-sqrt(x1))+y1-(y2-y1)/((sqrt(x2)-sqrt(x1))
--当x2或者x1<0, y=0,
--当x1=x2,有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Extrac(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then 
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--描绘连接线:Link(x,points)
--根据points提供的一系列点，用相邻的两个点描绘曲线
--return y值
--x 输入值
--points 点集合
--形如：points是形如{{x1,y1,func=xxx},{x2,y2,func=xxx},...{xn,yn,func=xxx}}的映射
function Link(x,points)
	num = getn(points)
	if(num<2) then
		return -1
	end
	for i=1,num do
		if(points[i][3]==nil) then
			points[i][3]=Line
		end
	end
	if(x < points[1][1]) then
		return points[1][3](x,points[1][1],points[1][2],points[2][1],points[2][2])
	end
	if(x > points[num][1]) then
		return points[num][3](x,points[num-1][1],points[num-1][2],points[num][1],points[num][2])
	end
	
	c = 2
	for i=2,num do
		if((x >= points[i-1][1]) and (x <= points[i][1])) then
			c = i
			break
		end
	end
	return points[c][3](x,points[c-1][1],points[c-1][2],points[c][1],points[c][2])
end

------------------------------------------------------
--技能设定格式如下：
--SKILLS={
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		。。。。。
--	}，
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		。。。。。
--	}，
--	。。。。。
--}
--如：
--SKILLS={
--	Sanhuan-taoyue={
--		physicsenhance_p={
--			[1]={{1,50},{20,335}},--魔法属性physicsenhance_p参数1，1级时为35，20级时为335，曲线不填，默认线形
--			[2]={{1,0},{20,0}},
--		},--没有[3]，表示魔法属性physicsenhance_p参数2，默认为任何时候都是0
--		lightingdamage_v={
--			[1]={{1,65},{20,350}},
--			[3]={{1,65},{20,350}},
--		}
--	}
--}
--以上描述技能“三环套月”的魔法属性和数值
-----------------------------------------------------------
--函数GetSkillLevelData(levelname, data, level)
--levelname：魔法属性名称
--data：技能名称
--level：技能等级
--return：当技能名称为data，技能等级为level
--			时的魔法属性levelname所需求的三个参数的具体值
-----------------------------------------------------------
function GetSkillLevelData(levelname, data, level)
	if(data==nil) then
		return ""
	end
	if(data == "") then
		return ""
	end
	if(SKILLS[data]==nil) then
		return ""
	end
	if(SKILLS[data][levelname]==nil) then
		return ""
	end
	if(type(SKILLS[data][levelname]) == "function") then
		return SKILLS[data][levelname](level)
	end
	if(SKILLS[data][levelname][1]==nil) then
		SKILLS[data][levelname][1]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][2]==nil) then
		SKILLS[data][levelname][2]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][3]==nil) then
		SKILLS[data][levelname][3]={{0,0},{20,0}}
	end
	p1=floor(Link(level,SKILLS[data][levelname][1]))
	p2=floor(Link(level,SKILLS[data][levelname][2]))
	p3=floor(Link(level,SKILLS[data][levelname][3]))
	return Param2String(p1,p2,p3)
end;


function Param2String(Param1, Param2, Param3)
return Param1..","..Param2..","..Param3
end;
