DS_DEN_BU={
	[1]={
		[1] = "˜H˜a˜d˜e˜s",
		[2] = 1
	},
	[2]={
		[1] = "GiãÙMïaÙ§«ngÙB¾c",
		[2] = 1
	},
	[3]={
		[1] = "GËy§¸nhCÈu",
		[2] = 1
	},
	[4]={
		[1] = "TAQPÙAnh2",
		[2] = 0
	},
	[5]={
		[1] = "zXzNgaMyXinhzXz",
		[2] = 1
	},
	[6]={
		[1] = "SongNghi",
		[2] = 0
	},
	[7]={
		[1] = "KimÙCang",
		[2] = 1
	},
	[8]={
		[1] = "MüÙN÷ÙPhiªuÙDiªu",
		[2] = 0
	},
	[9]={
		[1] = "HáaÙPhôngÙHoµng",
		[2] = 1
	},
	[10]={
		[1] = "BiÙCali",
		[2] = 0
	},
	[11]={
		[1] = "H¹nhÙNhi",
		[2] = 1
	},
	[12]={
		[1] = "memay03",
		[2] = 0
	},
	[13]={
		[1] = "SayNewÙCäp",
		[2] = 1
	},
	[14]={
		[1] = "BèiÙVyÙVy",
		[2] = 0
	},
	[15]={
		[1] = "concu00",
		[2] = 0
	},
	[16]={
		[1] = "AEÙ•ÙL­uÙNgµÙÙÙ",
		[2] = 1
	},
	[17]={
		[1] = "SÇuÙRiªng",
		[2] = 0
	},
	[18]={
		[1] = "LamÙPh­îngÙHoµng",
		[2] = 1
	},
	[19]={
		[1] = "VGÙGaLaXy",
		[2] = 0
	},
	[20]={
		[1] = "•Ä•…………X…………•Ä•Ù",
		[2] = 1
	},
	[21]={
		[1] = "Eyc_Zhly",
		[2] = 0
	},
	[22]={
		[1] = "ÙPortgasÙD.Ace",
		[2] = 1
	},
	[23]={
		[1] = "T­ÙM·ÙV«ÙT×nh",
		[2] = 0
	},
	[24]={
		[1] = "LyCaTiÕu",
		[2] = 1
	},
	[25]={
		[1] = "Xuka•Di•Vespa",
		[2] = 0
	},
	[26]={
		[1] = "•°•…B¶oÙBèi…•°•",
		[2] = 1
	},
	[27]={
		[1] = "Hoµng±ViÖt",
		[2] = 1
	},
	[28]={
		[1] = "AE*V×EmAnhChiÕn",
		[2] = 0
	},
	[29]={
		[1] = "LyÙThuÙThuy",
		[2] = 1
	},
	[30]={
		[1] = "AEŸ*ŸHuyCon",
		[2] = 0
	},
	[31]={
		[1] = "B¶oH©n",
		[2] = 0
	},
	[32]={
		[1] = "HoangThienKy",
		[2] = 1
	},
	[33]={
		[1] = "~TiÓuÙC«ÙN­¬ng~",
		[2] = 0
	},
	[34]={
		[1] = "Xoac_Thu",
		[2] = 1
	},
	[35]={
		[1] = "CongAnThon",
		[2] = 0
	},
	[36]={
		[1] = "TestDuaTop",
		[2] = 1
	}
}