KHUYEN_KHICH={
	[1]={
		[1] = "~•NhÞÙ§Ö•~",
		[2] = 0
	},
	[2]={
		[1] = "PÐÙKháeÙBÐÙTr©u",
		[2] = 0
	},
	[3]={
		[1] = "Tr­¬ngÙTamÙPhong",
		[2] = 0
	},
	[4]={
		[1] = "ZzZbidaZzZ",
		[2] = 1
	},
	[5]={
		[1] = "LyCaTiÕu",
		[2] = 1
	},
	[6]={
		[1] = "SÇuÙRiªng",
		[2] = 0
	},
	[7]={
		[1] = "SongNghi",
		[2] = 0
	},
	[8]={
		[1] = "AEÙ•ÙL­uÙNgµÙÙÙ",
		[2] = 1
	},
	[9]={
		[1] = "KimÙCang",
		[2] = 1
	},
	[10]={
		[1] = "MaiÙÄÙPh­¬ngÙ@1",
		[2] = 1
	},
	[11]={
		[1] = "˜H˜a˜d˜e˜s",
		[2] = 1
	},
	[12]={
		[1] = "zXzNgaMyXinhzXz",
		[2] = 1
	},
	[13]={
		[1] = "ThanhÙV©n",
		[2] = 0
	},
	[14]={
		[1] = "GËy§¸nhCÈu",
		[2] = 1
	},
	[15]={
		[1] = "GiãÙMïaÙ§«ngÙB¾c",
		[2] = 1
	},
	[16]={
		[1] = "TïngÙT©y*",
		[2] = 0
	},
	[17]={
		[1] = "s2•Nh­ÙNgäc",
		[2] = 1
	},
	[18]={
		[1] = "AE*V×EmAnhChiÕn",
		[2] = 0
	},
	[19]={
		[1] = "Hoµng±ViÖt",
		[2] = 1
	},
	[20]={
		[1] = "•°•…B¶oÙBèi…•°•",
		[2] = 1
	},
	[21]={
		[1] = "TestDuaTop",
		[2] = 1
	}
}