DSTOP={
	[1]={
		[1] = "V­¬ng*Chiªu*Qu©n",
		[2] = 906
	},
	[2]={
		[1] = "75ÿThiÙB¹ch",
		[2] = 762
	},
	[3]={
		[1] = "T.Xa§o¹.",
		[2] = 264
	},
	[4]={
		[1] = "•ChaÄThiªn…H¹•",
		[2] = 75
	},
	[5]={
		[1] = "L·ngÙTöÙPhong",
		[2] = 60
	},
	[6]={
		[1] = "*Bi_Linh_Bon*",
		[2] = 55
	},
	[7]={
		[1] = "Michael",
		[2] = 51
	},
	[8]={
		[1] = "¤ngÙTrïmÙ§ÊtÙMòi",
		[2] = 50
	},
	[9]={
		[1] = "ThapÙTamÙMuoi",
		[2] = 46
	},
	[10]={
		[1] = "Yamateeee",
		[2] = 46
	}
}