
--迭代函数，用于计算技能熟练度
--具体方法：
--根据1级熟练度，升级加速度，级数，重复伤害次数，范围，计算出相应等级熟练度
-- SkillExp(i) = Exp1*a^(i-1)*time*range

function SkillExpFunc(Exp0,a,Level,Time,Range)
	return floor(Exp0*(a^(Level-1))*Time*Range/2)
end


SKILLS={
       
	--丐帮
	gaibang_bangfa={ --丐帮棒法
		addphysicsdamage_p={{{1,10},{20,150}},{{1,-1},{2,-1}},{{1,2},{2,2}}},
		deadlystrikeenhance_p={{{1,2},{20,25,Conic}},{{1,-1},{2,-1}}},
knockbackenhance_p={{{1,0},{20,5},{21,5}}}
	},
	gaibang_zhangfa={ --丐帮掌法
		fireskill_v={{{1,25},{20,275}},{{1,-1},{2,-1}}},
knockbackenhance_p={{{1,0},{20,5},{21,5}}}
	},
	yanmen_tuobo={ --沿门托钵
		seriesdame={{{1,1},{20,10}},{{1,3},{2,3}}},
		physicsenhance_p={{{1,10},{20,55}}},
		firedamage_v={
			[1]={{1,10},{20,100}},
			[3]={{1,10},{20,150}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-650}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		addskilldame1={{{1,389},{20,389}},{{1,1},{20,40}}},
		addskilldame2={{{1,125},{20,125}},{{1,1},{20,35}}},
		missle_speed_v={{{1,20},{20,24}}},
		skill_attackradius={{{1,320},{20,384}}},
		skill_cost_v={{{1,10},{20,10}}},
skill_eventskilllevel={{{1,1},{2,2}}},
changecamp_b={{{1,0},{20,5},{21,5}}},
slowmissle_b={{{1,0},{20,3},{21,3}}}
	},
	jianren_shenshou={ --见人伸手
		seriesdame={{{1,1},{20,10}},{{1,3},{2,3}}},
		firedamage_v={
			[1]={{1,15},{20,75}},
			[3]={{1,15},{20,215}}
		},
		addskilldame1={{{1,362},{20,362}},{{1,1},{20,50}}},
		addskilldame2={{{1,128},{20,128}},{{1,1},{20,35}}},
lifereplenish_v={{{1,0},{60,0},{61,-950}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		missle_speed_v={{{1,20},{20,24}}},
		skill_attackradius={{{1,320},{20,384}}},
		skill_cost_v={{{1,25},{20,25}}},
skill_eventskilllevel={{{1,1},{2,2}}},
changecamp_b={{{1,0},{20,5},{21,5}}},
slowmissle_b={{{1,0},{20,3},{21,3}}}
	},
	huabu_liushou={ --滑不留手
		fastwalkrun_p={{{1,9},{20,66}},{{1,18*120},{20,18*180}}},
		skill_cost_v={{{1,24},{20,50}}}
	},
	dagou_zhen={ --打狗阵
		addphysicsdamage_p={{{1,10},{20,175}},{{1,-1},{10,-1}},{{1,2},{2,2}}},
	},
	xianglong_zhang={ --降龙掌
		lifemax_p={{{1,-1},{20,-25}},{{1,-1},{2,-1}}},
		manamax_p={{{1,12},{20,50}},{{1,-1},{2,-1}}},
		fireskill_v={{{1,35},{15,250},{20,750}},{{1,-1},{2,-1}}},
	},
	bangda_egou={ --棒打恶狗
		physicsenhance_p={{{1,10},{20,179}}},
		seriesdame={{{1,10},{20,50},{21,52}},{{1,3},{2,3}}},
lifereplenish_v={{{1,0},{60,0},{61,-1500}},{{1,3*18},{60,3*18},{61,9},{62,9}}},		
                
                firedamage_v={
			[1]={{1,70},{20,360},{51,360}},
			[3]={{1,70},{20,420},{51,420}}
		},
		addskilldame1={{{1,389},{20,389}},{{1,1},{20,60}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{50,0},{51,20}},
			[3]={{1,0},{2,0}}
		},
		missle_speed_v={{{1,30},{20,30}}},
skill_eventskilllevel={{{1,1},{50,50},{51,0},{57,0}}},
		skill_attackradius={{{1,448},{20,512}}},
		skill_cost_v={{{1,28},{20,48}}},
slowmissle_b={{{1,0},{20,7},{21,7}}}
	},
	zuidie_kuangwu={ --醉碟狂舞
		allres_p={{{1,1},{30,30}},{{1,18*120},{30,18*180}}},
		fireskill_v={{{1,10},{30,215}},{{1,18*120},{30,18*180}}},
		addfiredamage_v={{{1,10},{30,175}},{{1,18*120},{30,18*180}}},
		deadlystrikeenhance_p={{{1,5},{20,30,Conic}},{{1,18*120},{30,18*180}}},
		skill_cost_v={{{1,50},{20,100}}},
addphysicsdamage_p={{{1,10},{30,215}},{{1,18*120},{2,18*120}},{{1,2},{2,2}}},
	},
cbtang4={ --天下无狗
		seriesdame={{{1,50},{50,150}},{{1,3},{2,3}}},
		skill_misslenum_v={{{1,1},{20,4},{44,4},{45,5}}},
		physicsenhance_p={{{1,12},{15,150},{20,250}}},
		firedamage_v={
			[1]={{1,500},{20,4000}},
			[3]={{1,500},{20,4000}}
		},
		
		missle_speed_v={{{1,32},{20,32},{21,32}}},
		skill_attackradius={{{1,55},{20,55},{21,55}}},
missle_lifetime_v={{{1,10},{20,10}}},
		skill_cost_v={{{1,0},{20,0}}},
	},
	kanglong_youhui={ --亢龙有悔//未完，待续
		seriesdame={{{1,10},{20,50}},{{1,3},{2,3}}},
		firedamage_v={
			[1]={{1,10},{20,536}},
			[3]={{1,10},{20,536}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-1700}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		addskilldame1={{{1,362},{20,362}},{{1,1},{20,55}}},
missle_lifetime_v={{{1,9},{20,9}}},
		skill_misslesform_v={{{1,1},{10,1},{10,2},{20,2}}},
		skill_misslenum_v={{{1,1},{10,1},{20,15},{25,18},{26,18}}},
		skill_param1_v={{{1,0},{10,0},{10,2},{20,2},{21,2}}},
		missle_speed_v={{{1,28},{20,32}}},
		skill_attackradius={{{1,448},{20,512}}},
skill_eventskilllevel={{{1,1},{50,50},{51,0},{57,0}}},
		skill_cost_v={{{1,10},{20,50}}},
slowmissle_b={{{1,0},{20,7},{21,7}}}
	},
	huaxian_weiyi={ --化险为夷
		meleedamagereturn_p={{{1,4},{20,46}},{{1,-1},{20,-1}}},
		adddefense_v={{{1,48},{20,800}},{{1,-1},{20,-1}}},
	},
cbtang3={ --天下无狗
		seriesdame={{{1,150},{50,150}},{{1,3},{2,3}}},
		skill_misslenum_v={{{1,1},{25,1},{49,6},{50,9},{51,9}}},
		physicsenhance_p={{{1,12},{15,50},{40,250},{50,2000},{55,4000}}},
		firedamage_v={
			[1]={{1,1000},{30,5000}},
			[3]={{1,1000},{30,5000}}
		},
		
		missle_speed_v={{{1,20},{20,20},{21,20}}},
		skill_attackradius={{{1,500},{20,500},{21,500}}},
missle_lifetime_v={{{1,15},{20,15}}},
		skill_cost_v={{{1,0},{20,0}}},
	},
	xiaoyao_gong={ --逍遥功
		attackspeed_v={{{1,6},{20,65}},{{1,-1},{2,-1}}},
		castspeed_v={{{1,6},{20,65}},{{1,-1},{2,-1}}},
	},
cuonglongvocautran={ --天下无狗
		seriesdame={{{1,50},{50,150}},{{1,3},{2,3}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,25},{2,25}},
			[3]={{1,0},{2,0}}
		},
		skill_misslenum_v={{{1,1},{20,1},{25,3},{30,3},{50,3}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		physicsenhance_p={{{1,500},{20,1500},{40,2000},{49,3000},{50,5000},{55,10000}}},
		firedamage_v={
			[1]={{1,1000},{20,2000},{40,4000},{50,5000},{55,10000},{59,20000},{60,50000}},
			[3]={{1,1000},{20,2000},{40,4000},{50,5000},{55,10000},{59,20000},{60,50000}}
		},		
		missle_speed_v={{{1,30},{20,30},{21,30}}},
		skill_attackradius={{{1,55},{20,55},{21,55}}},
missle_lifetime_v={{{1,7},{20,7}}},
		skill_cost_v={{{1,0},{20,0}}},
	},
	feilong_zaitian={ --飞龙在天
		seriesdame={{{1,20},{15,20},{20,60},{21,62}},{{1,3},{2,3}}},
				skilllevelexp={{{1,18*15*3},{2,45*15*3},{3,90*15*3},{4,180*15*3},{5,360*15*3},{6,720*15*3},{7,1080*15*3},{8,1530*15*3},{9,2070*15*3},{10,3150*15*3},{11,4590*15*3},{12,6480*15*3},{13,8550*15*3},{14,11790*15*3},{15,16830*15*3},{16,21960*15*3},{17,32130*15*3},{18,46080*15*3},{19,89100*15*3},{20,0}},{{1,362},{20,362}},{{1,191},{2,191}}},

		firedamage_v={
			[1]={{1,10*4/3},{15,300*4/3},{20,750*4/3}},
			[3]={{1,10*4/3},{15,300*4/3},{20,750*4/3}}
		},
		missle_speed_v={{{1,20},{20,24},{21,24}}},
fireres_p={{{1,-1},{20,-20},{30,-40},{31,-40}},{{1,18},{2,18}}},
lifereplenish_v={{{1,0},{60,0},{60,-4000},{61,-6000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		stunenhance_p={{{1,0},{10,1},{20,5},{21,5}}},
		skill_misslenum_v={{{1,1},{11,1},{12,2},{15,2},{16,3},{20,4},{21,4}}},
		skill_attackradius={{{1,448},{20,512},{21,512}}},
		skill_cost_v={{{1,10},{20,65}}},
		skill_eventskilllevel={{{1,0},{10,0},{11,11},{20,20}}},
		skill_collideevent={
			[1]={{1,0},{10,0},{10,1},{20,1}},
			[3]={{1,389},{20,389}}
		},
		skill_showevent={{{1,0},{10,0},{10,4},{20,4}}},
	},
	qianlong_zaiyuan={ --潜龙在渊
		seriesdame={{{1,20},{20,60}},{{1,3},{2,3}}},
		firedamage_v={
			[1]={{1,17},{20,171}},
			[3]={{1,17},{20,171}}
		},
steallifeenhance_p={{{1,0},{20,0},{21,-10},{30,-50},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
lifereplenish_v={{{1,0},{20,0},{21,-50},{30,-300},{59,0},{60,-6000},{61,-8000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
	},
	longzhan_yuye={ --龙战于野
		seriesdame={{{1,20},{20,60},{21,62}},{{1,3},{2,3}}},
		firedamage_v={
			[1]={{1,17},{20,371}},
			[3]={{1,17},{20,371}}
		},
		skill_eventskilllevel={{{1,1},{20,20}}},
		skill_collideevent={
			[1]={{1,0},{15,0},{15,1},{20,1}},
			[3]={{1,358},{20,358}}
		},
		skill_showevent={{{1,0},{15,0},{15,4},{20,4}}},
	},
tianxia_wugou={ --天下无狗
		seriesdame={{{1,20},{15,20},{20,60},{21,62}},{{1,3},{2,3}}},
		skill_misslenum_v={{{1,1},{10,2},{20,3},{21,3}}},
				skilllevelexp={{{1,18*15*3},{2,46*15*3},{3,92*15*3},{4,184*15*3},{5,368*15*3},{6,736*15*3},{7,1104*15*3},{8,1564*15*3},{9,2116*15*3},{10,3220*15*3},{11,4692*15*3},{12,6624*15*3},{13,8740*15*3},{14,12052*15*3},{15,17204*15*3},{16,22448*15*3},{17,32844*15*3},{18,47104*15*3},{19,91080*15*3},{20,0}},{{1,389},{20,389}},{{1,192},{2,192}}},

		physicsenhance_p={{{1,12*4/3},{15,100*4/3},{20,206*4/3}}},
physicsres_p={{{1,-1},{20,-15},{30,-30},{31,-30}},{{1,18},{2,18}}},
fireres_p={{{1,-1},{20,-15},{30,-30},{31,-30}},{{1,18},{2,18}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{50,0},{51,25}},
			[3]={{1,0},{2,0}}
		},
steallifeenhance_p={{{1,0},{20,0},{21,-10},{30,-50},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
lifereplenish_v={{{1,0},{20,0},{21,-30},{30,-250},{59,0},{60,-4500},{61,-6500}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		firedamage_v={
			[1]={{1,70},{15,150},{20,285}},
			[3]={{1,70},{15,200},{20,432}}
		},
		
		missle_speed_v={{{1,20},{20,24},{21,24}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		skill_cost_v={{{1,16},{20,54}}},
stunenhance_p={{{1,0},{10,1},{20,5},{21,5}}},
	},

ttcbr1={ --飞龙在天
		seriesdame={{{1,0},{10,0},{11,20},{20,60},{21,62}},{{1,3},{2,3}}},
		firedamage_v={
			[1]={{1,10*3/2},{10,203*3/2},{20,1080*3/2},{30,2014*3/2},{51,1080*3/2}},
			[3]={{1,10*3/2},{10,203*3/2},{20,1080*3/2},{30,2014*3/2},{51,1080*3/2}}
		},
		missle_speed_v={{{1,20},{20,24},{21,24}}},
fireres_p={{{1,-2},{20,-30},{30,-60},{31,-60}},{{1,18},{2,18}}},
lifereplenish_v={{{1,0},{60,0},{60,-4000},{61,-6000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		stunenhance_p={{{1,0},{10,1},{20,5},{21,5}}},
		skill_misslenum_v={{{1,1},{12,2},{16,3},{20,4},{21,4}}},
		skill_attackradius={{{1,448},{20,512},{21,512}}},
		skill_cost_v={{{1,10},{20,65}}},
		skill_eventskilllevel={{{1,0},{10,0},{11,11},{20,20}}},
		skill_collideevent={
			[1]={{1,0},{10,0},{10,1},{20,1}},
			[3]={{1,389},{20,389}}
		},
},

ttcbr2={ --潜龙在渊
		seriesdame={{{1,20},{20,60}},{{1,3},{2,3}}},
		firedamage_v={
			[1]={{1,17*3/2},{20,271*3/2},{30,542*3/2},{51,271*3/2}},
			[3]={{1,17*3/2},{20,271*3/2},{30,542*3/2},{51,271*3/2}}
		},
steallifeenhance_p={{{1,0},{20,0},{21,-10},{30,-50},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
lifereplenish_v={{{1,0},{20,0},{21,-50},{30,-300},{59,0},{60,-6000},{61,-8000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
	},

ttcbb1={ --天下无狗
		seriesdame={{{1,0},{10,0},{11,20},{20,60},{21,62}},{{1,3},{2,3}}},
		skill_misslenum_v={{{1,3},{10,3},{20,9},{21,9}}},
		physicsenhance_p={{{1,20*3/2},{10,380*3/2},{20,744*3/2},{30,1488*3/2},{51,744*3/2}}},
physicsres_p={{{1,-2},{20,-25},{30,-50},{31,-50}},{{1,18},{2,18}}},
fireres_p={{{1,-2},{20,-25},{30,-50},{31,-50}},{{1,18},{2,18}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{59,25},{60,25}},
			[3]={{1,0},{2,0}}
		},
steallifeenhance_p={{{1,0},{20,0},{21,-10},{30,-50},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
lifereplenish_v={{{1,0},{20,0},{21,-30},{30,-250},{59,0},{60,-4500},{61,-6500}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		firedamage_v={
			[1]={{1,60*3/2},{10,320*3/2},{20,640*3/2},{30,1280*3/2},{51,640*3/2}},
			[3]={{1,100*3/2},{10,568*3/2},{20,1128*3/2},{30,2256*3/2},{51,1128*3/2}}
		},
		
		missle_speed_v={{{1,20},{20,24},{21,24}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		skill_cost_v={{{1,16},{20,54}}},
stunenhance_p={{{1,0},{10,1},{20,5},{21,5}}},
	},

	gaibang120={ --丐帮120级技能
		
		attackspeed_v={{{1,2},{20,50},{21,55}},{{1,-1},{2,-1}}},
		castspeed_v={{{1,1},{20,20},{21,22}},{{1,-1},{2,-1}}},
			
	},
      skill120={
                stateskilltime={{{1,1},{20,1}},{{1,-1},{2,-1}}},
		skilllevelexp={{{1,18},{2,45},{3,90},{4,180},{5,360},{6,720},{7,1080},{8,1530},{9,2070},{10,3150},{11,4590},{12,6480},{13,8550},{14,11790},{15,16830},{16,21960},{17,32130},{18,46080},{19,89100},{20,89100},{21,89100},{22,89100},{23,89100},{24,89100},{25,89100}},{{1,0},{20,0}},{{1,140},{2,140}}},
		timecastskilleffec1_v={{{1,18*18},{20,9*18},{21,9*18}},{{1,-1},{2,-1}}},
                doskilleffec1_p={{{1,1},{20,6},{21,6}},{{1,477},{2,477}},{{1,1},{20,20}}},
	},
      skill120b={
                stateskilltime={{{1,1},{20,1}},{{1,3*18},{20,9*18},{21,9*18}}},
                fireres_p={{{1,-1},{20,-10},{21,-10}},{{1,3*18},{20,9*18},{21,9*18}}},
                physicsres_p={{{1,-1},{20,-15},{21,-15}},{{1,3*18},{20,9*18},{21,9*18}}},
                rangedamagereturn_p={{{1,-3},{20,-30},{21,-30}},{{1,3*18},{20,9*18},{21,9*18}}},
	},
	gaibang150={ --150级技能
		skill_cost_v={{{1,100},{20,200},{21,220}},{{1,-1},{2,-1}}},
		fireskill_v={{{1,1000},{20,10000},{21,11000}},{{1,18*120},{20,18*120}}},
		deadlystrikeenhance_p={{{1,6},{20,35},{21,21}},{{1,18*120},{20,18*120}}},
		addskilldame1={{{1,20000},{20,500000},{21,550000}},{{1,18*120},{20,18*120}}},
		fastwalkrun_p={{{1,10},{20,100},{21,110}},{{1,18*10},{20,18*10}}}
	},
}
-----------------------------------------------
--Create by yfeng 2004-05-20
-----------------------------------------------

-----------------------------------------------
--根据2个点，求线形函数f(x)=k*x+b
--y= (y2-y1)*(x-x1)/(x2-x1)+y1
--当x2=x1, 有x=c,该直线是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：
function Line(x,x1,y1,x2,y2)
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--根据2个点，求2次形函数f(x)=a*x2+c
--y= (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
--当x1或者x2 < 0 ,y =0
--当x2=x1, 有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Conic(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then 
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
end

-----------------------------------------------
--根据2个点，求-2次形函数f(x)=a*sqrt(x2)+c
--y=(y2-y1)*x/(sqrt(x2)-sqrt(x1))+y1-(y2-y1)/((sqrt(x2)-sqrt(x1))
--当x2或者x1<0, y=0,
--当x1=x2,有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Extrac(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then 
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--描绘连接线:Link(x,points)
--根据points提供的一系列点，用相邻的两个点描绘曲线
--return y值
--x 输入值
--points 点集合
--形如：points是形如{{x1,y1,func=xxx},{x2,y2,func=xxx},...{xn,yn,func=xxx}}的映射
function Link(x,points)
	num = getn(points)
	if(num<2) then
		return -1
	end
	for i=1,num do
		if(points[i][3]==nil) then
			points[i][3]=Line
		end
	end
	if(x < points[1][1]) then
		return points[1][3](x,points[1][1],points[1][2],points[2][1],points[2][2])
	end
	if(x > points[num][1]) then
		return points[num][3](x,points[num-1][1],points[num-1][2],points[num][1],points[num][2])
	end
	
	c = 2
	for i=2,num do
		if((x >= points[i-1][1]) and (x <= points[i][1])) then
			c = i
			break
		end
	end
	return points[c][3](x,points[c-1][1],points[c-1][2],points[c][1],points[c][2])
end

------------------------------------------------------
--技能设定格式如下：
--SKILLS={
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		。。。。。
--	}，
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		。。。。。
--	}，
--	。。。。。
--}
--如：
--SKILLS={
--	Sanhuan-taoyue={
--		physicsenhance_p={
--			[1]={{1,50},{20,335}},--魔法属性physicsenhance_p参数1，1级时为35，20级时为335，曲线不填，默认线形
--			[2]={{1,0},{20,0}},
--		},--没有[3]，表示魔法属性physicsenhance_p参数2，默认为任何时候都是0
--		lightingdamage_v={
--			[1]={{1,65},{20,350}},
--			[3]={{1,65},{20,350}},
--		}
--	}
--}
--以上描述技能“三环套月”的魔法属性和数值
-----------------------------------------------------------
--函数GetSkillLevelData(levelname, data, level)
--levelname：魔法属性名称
--data：技能名称
--level：技能等级
--return：当技能名称为data，技能等级为level
--			时的魔法属性levelname所需求的三个参数的具体值
-----------------------------------------------------------
function GetSkillLevelData(levelname, data, level)
	if(data==nil) then
		return ""
	end
	if(data == "") then
		return ""
	end
	if(SKILLS[data]==nil) then
		return ""
	end
	if(SKILLS[data][levelname]==nil) then
		return ""
	end
	if(type(SKILLS[data][levelname]) == "function") then
		return SKILLS[data][levelname](level)
	end
	if(SKILLS[data][levelname][1]==nil) then
		SKILLS[data][levelname][1]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][2]==nil) then
		SKILLS[data][levelname][2]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][3]==nil) then
		SKILLS[data][levelname][3]={{0,0},{20,0}}
	end
	p1=floor(Link(level,SKILLS[data][levelname][1]))
	p2=floor(Link(level,SKILLS[data][levelname][2]))
	p3=floor(Link(level,SKILLS[data][levelname][3]))
	return Param2String(p1,p2,p3)
end;


function Param2String(Param1, Param2, Param3)
return Param1..","..Param2..","..Param3
end;

