--迭代函数，用于计算技能熟练度
--具体方法：
--根据1级熟练度，升级加速度，级数，重复伤害次数，范围，计算出相应等级熟练度
-- SkillExp(i) = Exp1*a^(i-1)*time*range
function SkillExpFunc(Exp0,a,Level,Time,Range)
	return floor(Exp0*(a^(Level-1))*Time*Range/2)
end


SKILLS={
	--峨嵋
	piaoyun_chuanxue={ --飘云穿雪
		physicsdamage_v={
			[1]={{1,10},{20,120}},
			[3]={{1,10},{20,120}},
		},
		seriesdame={{{1,1},{20,10}},{{1,2},{2,2}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		colddamage_v={
			[1]={{1,15},{20,275}},
                        [2]={{1,0},{20,0},{56,25}},
			[3]={{1,25},{20,415}}
		},
		addskilldame2={{{1,370},{20,370}},{{1,1},{20,75}}},
		addskilldame1={{{1,91},{20,91}},{{1,1},{20,35}}},
		
lifereplenish_v={{{1,0},{60,0},{61,-500}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		missle_speed_v={{{1,20},{20,24}}},
		skill_attackradius={{{1,320},{20,384}}},
		skill_cost_v={{{1,10},{20,10}}},
changecamp_b={{{1,0},{20,5},{21,5}}}
	},
	emei_jianfa={ --峨嵋剑法
		addphysicsdamage_p={{{1,15*3/2},{20,215*3/2}},{{1,-1},{2,-1}},{{1,0},{2,0}}},
		deadlystrikeenhance_p={{{1,6},{20,36}},{{1,-1},{2,-1}}},
knockbackenhance_p={{{1,0},{20,5},{21,5}}}
	},
	emei_zhangfa={ --峨嵋掌法
		waterskill_v={{{1,15},{20,515}},{{1,-1},{2,-1}}},
knockbackenhance_p={{{1,0},{20,5},{21,5}}}
	},
	sixiang_tonggui={ --四相同归
		seriesdame={{{1,5},{20,30}},{{1,2},{2,2}}},
skill_eventskilllevel={{{1,1},{2,2}}},
lifereplenish_v={{{1,0},{60,0},{61,-800}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		colddamage_v={
			[1]={{1,35},{20,315}},
			[3]={{1,45},{20,450}}
		},
		addskilldame1={{{1,373},{20,373}},{{1,1},{20,76}}},

		skill_attackradius={{{1,384},{20,416}}},
		skill_cost_v={{{1,25},{20,35}}},
slowmissle_b={{{1,0},{20,3},{21,3}}}
	},
	yiye_zhiqiu={ --一叶知秋
		seriesdame={{{1,1},{20,10}},{{1,2},{2,2}}},
		physicsenhance_p={{{1,30},{20,75}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		colddamage_v={
			[1]={{1,10},{20,80}},
[2]={{1,0},{20,0}},
			[3]={{1,10},{20,80}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-450}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		deadlystrike_p={{{1,10},{20,20}}},
		addskilldame2={{{1,374},{20,374}},{{1,1},{20,60}}},
		addskilldame1={{{1,88},{20,88}},{{1,1},{20,35}}},
		
		missle_speed_v={{{1,20},{20,24}}},
		skill_attackradius={{{1,320},{20,384}}},
		skill_cost_v={{{1,25},{20,25}}},
changecamp_b={{{1,0},{20,5},{21,5}}}
	},
	liushui={--流水
		fastwalkrun_p={{{1,9},{20,66}},{{1,18*3},{2,18*3}}}
	},
	bumie_bujue={ --不灭不绝
		physicsenhance_p={{{1,80},{20,385}}},
skill_eventskilllevel={{{1,1},{50,50},{51,0},{57,0}}},
		seriesdame={{{1,20},{20,50}},{{1,2},{2,2}}},
lifereplenish_v={{{1,0},{60,0},{61,-1200}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		colddamage_v={
			[1]={{1,10},{20,282}},
			[3]={{1,10},{20,282}}
		},
		deadlystrike_p={{{1,15},{20,54}}},
		addskilldame1={{{1,374},{20,374}},{{1,1},{20,70}}},
		missle_speed_v={{{1,28},{20,32},{21,32}}},
		skill_attackradius={{{1,448},{20,512},{21,512}}},
		skill_cost_v={{{1,25},{20,32}}},
slowmissle_b={{{1,0},{20,7},{21,7}}}
	},
	mengdie={ --梦蝶
		lifereplenish_v={{{1,1},{20,15},{59,44},{60,100}},{{1,18*3},{2,18*3}}},
		manareplenish_v={{{1,1},{20,10},{59,28},{60,50}},{{1,18*3},{2,18*3}}},
skill_eventskilllevel={{{1,1},{2,2}}},
	},
	foguang_puzhao={ --佛光普照
		colddamage_v={
			[1]={{1,70},{20,787}},
[2]={{1,0},{50,0}},
			[3]={{1,80},{20,1287}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-1500}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
skill_eventskilllevel={{{1,1},{50,50},{51,0},{57,0}}},
		seriesdame={{{1,20},{20,50},{21,52}},{{1,2},{2,2}}},
		addskilldame1={{{1,370},{20,370}},{{1,1},{20,80}}},
		addskilldame2={
			[1]={{1,380},{2,380}},
			[3]={{1,1},{20,80}}
		},
		skill_cost_v={{{1,12},{20,37}}},
slowmissle_b={{{1,0},{20,7},{21,7}}}
	},
	cihang_pudu={ --慈航普渡
			lifereplenish_v={{{1,275},{20,750}},{{1,36},{2,36}}},
		skill_cost_v={{{1,100},{20,100}}}
	},
	fofa_wubian={ --佛法无边
		waterskill_v={{{1,30},{30,315}},{{1,-1},{2,-1}}},
		addcolddamage_v={{{1,70*3/2},{30,315*3/2}},{{1,-1},{2,-1}}},
		addphysicsdamage_p={{{1,10},{30,120}},{{1,-1},{2,-1}},{{1,6},{2,6}}},
		attackspeed_v={{{1,12},{30,65}},{{1,-1},{2,-1}}},
		castspeed_v={{{1,12},{30,65}},{{1,-1},{2,-1}}},
coldenhance_p={{{1,8},{30,37}},{{1,-1},{30,-1}}},
	},
	foxin_ciyou={ --佛心慈佑
		lifemax_p={{{1,30},{20,125}},{{1,18*8},{2,18*8}}},
	},
	tuichuang_wangyue={ --推窗望月
		physicsenhance_p={{{1,40},{20,175}}},
		seriesdame={{{1,5},{20,30}},{{1,2},{2,2}}},
		colddamage_v={
			[1]={{1,10},{20,120}},
[2]={{1,0},{20,0},{57,30}},
			[3]={{1,10},{20,120}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-800}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		deadlystrike_p={{{1,10},{20,30}}},
		addskilldame1={{{1,375},{20,375}},{{1,1},{20,49}}},
		missle_speed_v={{{1,24},{20,28}}},
		skill_attackradius={{{1,384},{20,448}}},
		skill_cost_v={{{1,20},{20,20}}},
slowmissle_b={{{1,0},{20,3},{21,3}}}
	},
	qingyin_fanchang={ --清音梵唱
		fasthitrecover_v={{{1,1},{20,20}},{{1,18*3},{2,18*3}}},
		fatallystrikeres_p={{{1,1},{20,20}},{{1,18*3},{2,18*3}}},
		freezetimereduce_p={{{1,1},{20,30}},{{1,18*3},{2,18*3}}},
		poisontimereduce_p={{{1,1},{20,30}},{{1,18*3},{2,18*3}}},
		stuntimereduce_p={{{1,1},{20,30}},{{1,18*3},{2,18*3}}}
	},
pudu_zhongsheng={ --普渡众生
		lifereplenish_v={{{1,1},{20,15}},{{1,18*3},{2,18*3}}},
		manareplenish_v={{{1,1},{20,10}},{{1,18*3},{2,18*3}}},
		allres_p={{{1,1},{20,40}},{{1,18*3},{2,18*3}}},
	},
	sane_jixue={ --三峨霁雪
		physicsenhance_p={{{1,21 * 11/10},{15,214 * 11/10},{20,508 * 11/10}}},
		seriesdame={{{1,20},{15,20},{20,60},{21,62}},{{1,2},{2,2}}},
		skilllevelexp={{{1,17*15*3},{2,43*15*3},{3,85*15*3},{4,170*15*3},{5,340*15*3},{6,680*15*3},{7,1020*15*3},{8,1445*15*3},{9,1955*15*3},{10,2975*15*3},{11,4335*15*3},{12,6120*15*3},{13,8075*15*3},{14,11135*15*3},{15,15895*15*3},{16,20740*15*3},{17,30345*15*3},{18,43520*15*3},{19,84150*15*3},{20,0}},{{1,374},{20,374}},{{1,192},{1,192}}},
	
	colddamage_v={
			[1]={{1,10*5 * 11/10},{20,111*5 * 11/10}},
			[3]={{1,10*5 * 11/10},{20,111*5 * 11/10}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-3500},{62,-6000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		deadlystrike_p={{{1,10},{20,54}}},
		missle_speed_v={{{1,28},{20,32},{21,32}}},
physicsres_p={{{1,-1},{20,-15},{30,-30},{31,-30}},{{1,18},{2,18}}},
coldres_p={{{1,-1},{20,-15},{30,-30},{31,-30}},{{1,18},{2,18}}},
stunenhance_p={{{1,0},{10,1},{20,5},{21,5}}},
lifemax_p={{{1,0},{20,0},{21,-15},{30,-60},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
freezetimereduce_p={{{1,0},{20,0},{21,-10},{30,-30},{59,0},{60,0}},{{1,3*18},{2,3*18},{61,9},{62,9}}},
		skill_attackradius={{{1,448},{20,512},{21,512}}},
		skill_cost_v={{{1,35},{20,35}}},
		skill_eventskilllevel={{{1,0},{10,0},{11,11},{20,20}}},
		skill_startevent={
			[1]={{1,0},{10,0},{10,1},{20,1}},
			[3]={{1,329},{20,329}}
		},
		skill_showevent={{{1,0},{10,0},{10,1},{20,1}}},
	},
	sane_jixue1={ --三峨霁雪
		skill_eventskilllevel={{{1,0},{10,0},{11,11},{20,20}}},
},
	yuquan_xichen={ --玉泉洗尘
		seriesdame={{{1,10},{20,60}},{{1,2},{2,2}}},
		physicsenhance_p={{{1,30*3},{20,148*3}}},
		deadlystrike_p={{{1,10},{20,20},{21,21}}},
skill_eventskilllevel={{{1,1},{2,2}}},
lifereplenish_v={{{1,0},{60,0},{61,-5000},{62,-8000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{50,0},{51,45}},
			[3]={{1,0},{2,0}}
		},
	},
ngoctamphathuu={ --风霜碎影
		seriesdame={{{1,50},{50,150}},{{1,2},{2,2}}},
		colddamage_v={
			[1]={{1,20},{15,700},{20,5000},{49,20000},{50,30000},{55,75000}},
			[3]={{1,30},{15,700},{20,5000},{49,20000},{50,30000},{55,75000}}
		},
		skill_eventskilllevel={{{1,0},{24,0},{25,25},{26,26}}},
		skill_cost_v={{{1,30},{20,65}}},
		
missle_lifetime_v={{{1,12},{20,12}}},
},


ngamitang4={ --风霜碎影
		seriesdame={{{1,150},{50,150}},{{1,2},{2,2}}},
		colddamage_v={
			[1]={{1,20},{15,50},{20,70}},
			[3]={{1,30},{15,50},{20,70}}
		},
		
		physicsenhance_p={{{1,10},{15,30},{25,200},{50,5000},{55,10000}}},
		
missle_lifetime_v={{{1,8},{20,8}}},
skill_misslenum_v={{{1,1},{35,1},{40,3},{50,4},{51,4}}},
		
	},
tang2ngami={ --风霜碎影
		seriesdame={{{1,150},{50,150}},{{1,2},{2,2}}},
		colddamage_v={
			[1]={{1,50},{25,500},{50,25000},{55,50000}},
			[3]={{1,50},{25,500},{50,25000},{55,50000}}
		},
		
		

		
	},
ngamitang3={ --风霜碎影
	
missle_lifetime_v={{{1,3},{20,3}}},
skill_eventskilllevel={{{1,0},{34,0},{35,35},{36,36}}},
		
	},
	fengshuang_suiying={ --风霜碎影
		seriesdame={{{1,20},{15,20},{20,60},{21,62}},{{1,2},{2,2}}},
				skilllevelexp={{{1,17*15*3},{2,43*15*3},{3,85*15*3},{4,170*15*3},{5,340*15*3},{6,680*15*3},{7,1020*15*3},{8,1445*15*3},{9,1955*15*3},{10,2975*15*3},{11,4335*15*3},{12,6120*15*3},{13,8075*15*3},{14,11135*15*3},{15,15895*15*3},{16,20740*15*3},{17,30345*15*3},{18,43520*15*3},{19,84150*15*3},{20,0}},{{1,370},{20,370}},{{1,191},{1,191}}},

		colddamage_v={
			[1]={{1,20},{15,350},{20,770}},
			[3]={{1,30},{15,400},{20,1000}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-2500},{62,-3500}},{{1,12*18},{60,12*18},{61,9},{62,9}}},
		skill_eventskilllevel={{{1,0},{10,0},{11,11},{20,20}}},
coldres_p={{{1,-1},{20,-20},{30,-40},{31,-40}},{{1,18},{2,18}}},
stunenhance_p={{{1,0},{10,1},{20,5},{21,5}}},
		skill_cost_v={{{1,30},{20,65}}},
lifemax_p={{{1,0},{20,0},{21,-10},{30,-50},{59,0},{60,0}},{{1,12*18},{60,12*18},{61,9},{62,9}}},
freezetimereduce_p={{{1,0},{20,0},{21,-10},{30,-40},{59,0},{60,0}},{{1,12*18},{60,12*18},{61,9},{62,9}}},
		skill_startevent={
			[1]={{1,0},{10,0},{10,1},{20,1}},
			[3]={{1,331},{20,331}}
		},
		skill_showevent={{{1,0},{10,0},{10,1},{20,1}}},
	},
	jinding_foguang={
		colddamage_v={
			[1]={{1,10},{20,750}},
			[3]={{1,10},{20,750}},
		},
lifereplenish_v={{{1,0},{60,0},{61,-4000},{62,-5500}},{{1,12*18},{60,12*18},{61,9},{62,9}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		seriesdame={{{1,20},{20,60}},{{1,2},{2,2}}},
		missle_speed_v={{{1,24},{20,28},{21,28}}},
		skill_misslenum_v={{{1,1},{10,1},{20,3},{21,3}}},
	},
	emei120={ --峨嵋120级技能
		
		freezetimereduce_p={{{1,2},{20,40},{21,45}},{{1,-1},{2,-1}}},
		poisontimereduce_p={{{1,2},{20,40},{21,45}},{{1,-1},{2,-1}}},
		stuntimereduce_p={{{1,2},{20,40},{21,45}},{{1,-1},{2,-1}}},
		
	},
       skill120={
                stateskilltime={{{1,1},{20,1}},{{1,18},{2,18}}},
		skilllevelexp={{{1,18},{2,45},{3,90},{4,180},{5,360},{6,720},{7,1080},{8,1530},{9,2070},{10,3150},{11,4590},{12,6480},{13,8550},{14,11790},{15,16830},{16,21960},{17,32130},{18,46080},{19,89100},{20,89100},{21,89100}},{{1,0},{20,0}},{{1,140},{1,140}}},
		doskillbuff1={{{1,86},{20,86}},{{1,1},{20,20}}},
		doskillbuff2={{{1,89},{20,89}},{{1,1},{20,20}}},
		doskillbuff3={{{1,92},{20,92}},{{1,1},{20,20}}},
		doskillbuff4={{{1,282},{20,282}},{{1,1},{20,20}}},
		doskillbuff5={{{1,291},{20,291}},{{1,1},{20,20}}},
	},
	emei150={ --150级技能
		skill_cost_v={{{1,50},{20,200},{21,220}},{{1,-1},{2,-1}}},
		addskilldame1={{{1,5000},{20,200000},{21,220000}},{{1,18*60},{20,18*60}}},
		addskilldame2={{{1,5000},{20,200000},{21,220000}},{{1,18*60},{20,18*60}}},
		addskilldame4={{{1,5000},{20,200000},{21,220000}},{{1,18*60},{20,18*60}}},
addskilldame3={{{1,5000},{20,200000},{21,220000}},{{1,18*60},{20,18*60}}},
lightingarmor_v={{{1,5000},{20,200000},{21,220000}},{{1,18*60},{20,18*60}}},
lifemax_p={{{1,20},{20,150},{21,155}},{{1,18*60},{20,18*60}}},
	},
}
-----------------------------------------------
--Create by yfeng 2004-05-20
-----------------------------------------------

-----------------------------------------------
--根据2个点，求线形函数f(x)=k*x+b
--y= (y2-y1)*(x-x1)/(x2-x1)+y1
--当x2=x1, 有x=c,该直线是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：
function Line(x,x1,y1,x2,y2)
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--根据2个点，求2次形函数f(x)=a*x2+c
--y= (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
--当x1或者x2 < 0 ,y =0
--当x2=x1, 有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Conic(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then 
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
end

-----------------------------------------------
--根据2个点，求-2次形函数f(x)=a*sqrt(x2)+c
--y=(y2-y1)*x/(sqrt(x2)-sqrt(x1))+y1-(y2-y1)/((sqrt(x2)-sqrt(x1))
--当x2或者x1<0, y=0,
--当x1=x2,有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Extrac(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then 
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--描绘连接线:Link(x,points)
--根据points提供的一系列点，用相邻的两个点描绘曲线
--return y值
--x 输入值
--points 点集合
--形如：points是形如{{x1,y1,func=xxx},{x2,y2,func=xxx},...{xn,yn,func=xxx}}的映射
function Link(x,points)
	num = getn(points)
	if(num<2) then
		return -1
	end
	for i=1,num do
		if(points[i][3]==nil) then
			points[i][3]=Line
		end
	end
	if(x < points[1][1]) then
		return points[1][3](x,points[1][1],points[1][2],points[2][1],points[2][2])
	end
	if(x > points[num][1]) then
		return points[num][3](x,points[num-1][1],points[num-1][2],points[num][1],points[num][2])
	end
	
	c = 2
	for i=2,num do
		if((x >= points[i-1][1]) and (x <= points[i][1])) then
			c = i
			break
		end
	end
	return points[c][3](x,points[c-1][1],points[c-1][2],points[c][1],points[c][2])
end

------------------------------------------------------
--技能设定格式如下：
--SKILLS={
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		。。。。。
--	}，
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		。。。。。
--	}，
--	。。。。。
--}
--如：
--SKILLS={
--	Sanhuan-taoyue={
--		physicsenhance_p={
--			[1]={{1,50},{20,335}},--魔法属性physicsenhance_p参数1，1级时为35，20级时为335，曲线不填，默认线形
--			[2]={{1,0},{20,0}},
--		},--没有[3]，表示魔法属性physicsenhance_p参数2，默认为任何时候都是0
--		lightingdamage_v={
--			[1]={{1,65},{20,350}},
--			[3]={{1,65},{20,350}},
--		}
--	}
--}
--以上描述技能“三环套月”的魔法属性和数值
-----------------------------------------------------------
--函数GetSkillLevelData(levelname, data, level)
--levelname：魔法属性名称
--data：技能名称
--level：技能等级
--return：当技能名称为data，技能等级为level
--			时的魔法属性levelname所需求的三个参数的具体值
-----------------------------------------------------------
function GetSkillLevelData(levelname, data, level)
	if(data==nil) then
		return ""
	end
	if(data == "") then
		return ""
	end
	if(SKILLS[data]==nil) then
		return ""
	end
	if(SKILLS[data][levelname]==nil) then
		return ""
	end
	if(type(SKILLS[data][levelname]) == "function") then
		return SKILLS[data][levelname](level)
	end
	if(SKILLS[data][levelname][1]==nil) then
		SKILLS[data][levelname][1]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][2]==nil) then
		SKILLS[data][levelname][2]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][3]==nil) then
		SKILLS[data][levelname][3]={{0,0},{20,0}}
	end
	p1=floor(Link(level,SKILLS[data][levelname][1]))
	p2=floor(Link(level,SKILLS[data][levelname][2]))
	p3=floor(Link(level,SKILLS[data][levelname][3]))
	return Param2String(p1,p2,p3)
end;


function Param2String(Param1, Param2, Param3)
return Param1..","..Param2..","..Param3
end;

