
--迭代函数，用于计算技能熟练度
--具体方法：
--根据1级熟练度，升级加速度，级数，重复伤害次数，范围，计算出相应等级熟练度
-- SkillExp(i) = Exp1*a^(i-1)*time*range
function SkillExpFunc(Exp0,a,Level,Time,Range)
	return floor(Exp0*(a^(Level-1))*Time*Range/2)
end


SKILLS={
	--天忍
	canyang_ruxue={ --残阳如血
		seriesdame={{{1,1},{20,10},{56,150}},{{1,3},{2,3}}},
		physicsenhance_p={{{1,5},{20,55}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		firedamage_v={
			[1]={{1,5},{20,50}},
			[3]={{1,5},{20,50}}
		},
		addskilldame1={{{1,365},{20,365}},{{1,1},{20,45}}},
		addskilldame2={{{1,142},{20,142}},{{1,1},{20,35}}},
lifereplenish_v={{{1,0},{60,0},{61,-650}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		missle_speed_v={{{1,20},{20,24}}},
		skill_attackradius={{{1,320},{20,384}}},
		skill_cost_v={{{1,8},{20,8}}},
changecamp_b={{{1,0},{20,5},{21,5}}}
	},
	tianren_daofa={ --天忍刀法
		fireskill_v={{{1,15},{20,215}},{{1,-1},{2,-1}}},
knockbackenhance_p={{{1,0},{20,5},{21,5}}}
	},
	tianren_maofa={ --天忍矛法
		addphysicsdamage_p={{{1,15},{20,215}},{{1,-1},{2,-1}},{{1,3},{2,3}}},
		attackratingenhance_p={{{1,15},{20,272}},{{1,-1},{2,-1}}},
		deadlystrikeenhance_p={{{1,6},{20,35}},{{1,-1},{2,-1}}},
knockbackenhance_p={{{1,0},{20,5},{21,5}}}
	},
	huolian_fenhua={ --火莲焚华
		meleedamagereturn_p={{{1,-5},{20,-35}},{{1,18*40},{20,18*120}}},
		skill_cost_v={{{1,12},{20,12}}}
	},
	huanying_feihu={ --幻影飞狐
		attackratingenhance_p={{{1,-15},{20,-132}},{{1,18*40},{20,18*120}}},
		skill_cost_v={{{1,20},{20,20}}}
	},
	tuishan_tianhai={ --推山填海
		seriesdame={{{1,5},{20,30}},{{1,3},{2,3}}},
skill_eventskilllevel={{{1,1},{2,2}}},
lifereplenish_v={{{1,0},{60,0},{61,-1100}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		firedamage_v={
			[1]={{1,5},{20,45}},
			[3]={{1,5},{20,45}}
		},
		addskilldame1={{{1,367},{20,367}},{{1,1},{20,115}}},
		skill_cost_v={{{1,32},{20,50}}},
slowmissle_b={{{1,0},{20,3},{21,3}}}
	},
	feihong_wuji={ --飞鸿无迹
		adddefense_v={{{1,-150},{20,-1100}},{{1,18*40},{20,18*120}}},
		skill_cost_v={{{1,25},{20,25}}}
	},
	liehuo_qingtian={ --烈火情天
		seriesdame={{{1,5},{20,30}},{{1,3},{2,3}}},
		physicsenhance_p={{{1,15},{20,75}}},
skill_eventskilllevel={{{1,1},{50,50},{51,0},{52,0}}},
lifereplenish_v={{{1,0},{60,0},{61,-850}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		firedamage_v={
			[1]={{1,8},{20,150}},
			[3]={{1,8},{20,150}}
		},
		colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{50,0},{51,20}},
			[3]={{1,0},{2,0}}
		},
		addskilldame1={{{1,365},{20,365}},{{1,1},{20,55}}},
	
		missle_speed_v={{{1,28},{20,28}}},
		skill_attackradius={{{1,384},{20,448}}},
		skill_cost_v={{{1,25},{20,25}}},
slowmissle_b={{{1,0},{20,3},{21,3}}}
	},
	toutian_huanri={ --偷天换日
		seriesdame={{{1,10},{20,50}},{{1,3},{2,3}}},
		physicsenhance_p={{{1,25},{20,231}}},
skill_eventskilllevel={{{1,1},{50,50},{51,0},{52,0}}},
		deadlystrike_p={{{1,4},{20,55}}},
		firedamage_v={
			[1]={{1,10},{20,482}},
			[3]={{1,10},{20,482}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-1500}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
	addskilldame1={{{1,365},{20,365}},{{1,1},{20,65}}},

		steallife_p={{{1,1},{20,8}}},
		stealmana_p={{{1,1},{20,6}}},
		missle_speed_v={{{1,26},{20,26}}},
		missle_lifetime_v={{{1,4},{2,4}}},
		skill_attackradius={{{1,78},{20,78}}},
		skill_cost_v={{{1,12},{20,20}}},
slowmissle_b={{{1,0},{20,7},{21,7}}}
	},
	limo_duopo={ --厉魔夺魄
		addphysicsdamage_p={{{1,-25},{20,-215},{46,-500}},{{1,18*40},{20,18*120}},{{1,6},{20,6}}},
		skill_cost_v={{{1,30},{20,30}}}
	},
	tanzhi_lieyan={ --弹指烈焰
		firedamage_v={
			[1]={{1,30},{20,225}},
			[3]={{1,30},{20,225}}
		},
		seriesdame={{{1,1},{20,10}},{{1,3},{2,3}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		addskilldame1={{{1,367},{20,367}},{{1,1},{20,100}}},
		addskilldame2={{{1,148},{20,148}},{{1,1},{20,35}}},

	
lifereplenish_v={{{1,0},{60,0},{61,-750}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		addskilldame2={
			[1]={{1,148},{2,148}},
			[3]={{1,1},{20,35}}
		},
		missle_speed_v={{{1,20},{20,24}}},
		skill_attackradius={{{1,320},{20,384}}},
		skill_cost_v={{{1,20},{20,30}}},
changecamp_b={{{1,0},{20,5},{21,5}}}
	},
	wuxing_zhen={ --五行阵
		adddefense_v={{{1,75},{20,550}},{{1,18},{20,18}}},
	},
	moyan_qisha={ --魔炎七杀
		seriesdame={{{1,10},{20,50},{21,52}},{{1,3},{2,3}}},
skill_eventskilllevel={{{1,1},{50,50},{51,0},{52,0}}},
		firedamage_v={
			[1]={{1,35},{20,637}},
			[3]={{1,35},{20,637}}
		},
		
		
		addskilldame1={{{1,368},{20,368}},{{1,1},{20,87}}},
	
		fatallystrike_p={{{1,12},{20,50}}},
		missle_speed_v={{{1,20},{20,24},{21,24}}},
		skill_attackradius={{{1,320},{20,384}}},
		skill_cost_v={{{1,20},{20,30}}},
slowmissle_b={{{1,0},{20,7},{21,7}}}
	},
	tianmo_jieti={ --天魔解体
		adddefense_v={{{1,75},{30,850}},{{1,18*120},{30,18*180}}},
fireskill_v={{{1,35},{30,315}},{{1,18*120},{30,18*180}}},
		attackratingenhance_p={{{1,65},{30,500}},{{1,18*120},{30,18*180}}},
		fasthitrecover_v={{{1,5},{30,58}},{{1,18*120},{20,18*180}}},
		addfiredamage_v={{{1,20},{30,315}},{{1,18*120},{30,18*180}}},
		fireenhance_p={{{1,31},{30,100}},{{1,18*120},{30,18*180}}},
		attackspeed_v={{{1,26},{30,102}},{{1,18*120},{30,18*360}}},
		castspeed_v={{{1,26},{30,81}},{{1,18*120},{30,18*360}}},
coldenhance_p={{{1,0},{2,0}},{{1,-1},{30,-1}}},
		skill_cost_v={{{1,100},{20,100}}}
	},
	beisu_qingfeng={ --悲酥清风
		fasthitrecover_v={{{1,-6},{20,-30}},{{1,18*40},{20,18*120}}},
		skill_cost_v={{{1,20},{20,30}}}
	},
	yunlong_ji={ --云龙击
			physicsenhance_p={{{1,19 * 11/10},{15,132 * 11/10},{20,586 * 11/10}}},
		seriesdame={{{1,20},{15,20},{20,60},{21,62}},{{1,3},{2,3}}},
				skilllevelexp={{{1,9*15*3},{2,22*15*3},{3,45*15*3},{4,90*15*3},{5,180*15*3},{6,360*15*3},{7,540*15*3},{8,765*15*3},{9,1035*15*3},{10,1575*15*3},{11,2295*15*3},{12,3240*15*3},{13,4275*15*3},{14,5895*15*3},{15,8415*15*3},{16,10980*15*3},{17,16065*15*3},{18,23040*15*3},{19,44550*15*3},{20,0}},{{1,365},{20,365}},{{1,192},{1,192}}},

		deadlystrike_p={{{1,4},{20,65}}},
		firedamage_v={
			[1]={{1,6 * 11/10},{15,100 * 11/10},{20,378 * 11/10}},
			[3]={{1,6 * 11/10},{15,100 * 11/10},{20,378 * 11/10}}
		},
physicsres_p={{{1,-1},{20,-15},{30,-30},{31,-30}},{{1,18},{2,18}}},
fireres_p={{{1,-1},{20,-15},{30,-30},{31,-30}},{{1,18},{2,18}}},
		steallife_p={{{1,1},{20,16}}},
colddamage_v={
			[1]={{1,8},{30,115},{51,85}},
[2]={{1,5},{30,25},{31,25}},
			[3]={{1,8},{30,115},{51,85}}
		},
lifereplenish_v={{{1,0},{20,0},{21,-40},{30,-200},{59,0},{60,0},{61,-4000},{62,-6000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		stealmana_p={{{1,1},{20,16}}},
		missle_speed_v={{{1,30},{20,30}}},
		missle_lifetime_v={{{1,4},{2,4}}},
		stunenhance_p={{{1,0},{10,1},{20,5},{21,5}}},
		skill_cost_v={{{1,30},{20,30}}},
skill_eventskilllevel={{{1,0},{10,0},{11,11},{20,20}}},
	},
nguchoatamvan={ --云龙击
		physicsenhance_p={{{1,45},{49,12000},{50,20000},{55,40000}}},
		seriesdame={{{1,50},{50,150}},{{1,3},{2,3}}},
		deadlystrike_p={{{1,4},{20,65}}},
		colddamage_v={{{1,100},{20,500},{45,1000},{50,2000}},{{1,20},{20,20}}},
skill_eventskilllevel={{{1,0},{24,0},{25,25},{50,50}}},
		steallifeenhance_p={{{1,1},{20,16}}},
skill_misslenum_v={{{1,1},{20,1},{30,2},{40,3},{50,3}}},
		stealmanaenhance_p={{{1,1},{20,16}}},
		missle_speed_v={{{1,30},{20,30}}},
		missle_lifetime_v={{{1,20},{2,20}}},
		skill_attackradius={{{1,120},{20,120}}},
		skill_cost_v={{{1,0},{20,0}}},
	},
	fenghuo_liantian={ --烽火连天
		seriesdame={{{1,20},{20,60}},{{1,3},{2,3}}},
		firedamage_v={
			[1]={{1,5},{20,40}},
			[3]={{1,5},{20,40}}
		},
	},
	tianwai_liuxing={ --天外流星
		seriesdame={{{1,20},{15,20},{20,60},{21,62}},{{1,3},{2,3}}},
				skilllevelexp={{{1,9*15*3},{2,22*15*3},{3,45*15*3},{4,90*15*3},{5,180*15*3},{6,360*15*3},{7,540*15*3},{8,765*15*3},{9,1035*15*3},{10,1575*15*3},{11,2295*15*3},{12,3240*15*3},{13,4275*15*3},{14,5895*15*3},{15,8415*15*3},{16,10980*15*3},{17,16065*15*3},{18,23040*15*3},{19,44550*15*3},{20,0}},{{1,367},{20,367}},{{1,191},{1,191}}},

		firedamage_v={
			[1]={{1,10},{15,180},{20,415}},
			[3]={{1,10},{15,180},{20,415}}
		},
fireres_p={{{1,-1},{20,-20},{30,-40},{31,-40}},{{1,18},{2,18}}},
		stunenhance_p={{{1,0},{10,1},{20,5},{21,5}}},
		skill_cost_v={{{1,20},{20,50}}},
		skill_eventskilllevel={{{1,0},{10,0},{11,11},{20,20}}},
lifereplenish_v={{{1,0},{20,0},{21,0},{30,0},{59,0},{60,0},{61,-3000},{62,-5000}},{{1,6*18},{60,6*18},{61,9},{62,9}}},
		skill_vanishedevent={
			[1]={{1,0},{10,0},{10,1},{20,1}},
			[3]={{1,363},{20,363}}
		},
		skill_showevent={{{1,0},{10,0},{10,8},{20,8}}},
	},
	yehuo_fencheng={ --业火焚城
		seriesdame={{{1,20},{20,60},{21,62}},{{1,3},{2,3}}},
	firedamage_v={
			[1]={{1,21},{15,150},{20,320}},
			[3]={{1,21},{15,150},{20,320}}
		},
steallifeenhance_p={{{1,0},{20,0},{21,-15},{30,-60},{59,0},{60,0}},{{1,6*18},{60,6*18},{61,9},{62,9}}},
lifereplenish_v={{{1,0},{20,0},{21,-40},{30,-200},{59,0},{60,0},{61,-5000},{62,-7000}},{{1,6*18},{60,6*18},{61,9},{62,9}}},
	},
tang2tn={ --业火焚城
		seriesdame={{{1,150},{25,80},{26,85}},{{1,3},{2,3}}},
		firedamage_v={
			[1]={{1,500},{25,2000},{45,15000},{50,30000},{55,50000}},
			[3]={{1,500},{25,2000},{45,15000},{50,30000},{55,50000}}
		},
missle_speed_v={{{1,6},{20,6}}},
		missle_lifetime_v={{{1,30},{2,30}}},
	},
	shehun_luanxin={ --摄魂乱心
		attackratingenhance_p={{{1,-12},{20,-128}},{{1,18*120},{20,18*120}}},
		adddefense_v={{{1,-80},{20,-800}},{{1,18*120},{20,18*120}}},
		addphysicsdamage_p={{{1,-15},{20,-215}},{{1,18*120},{20,18*120}},{{1,6},{20,6}}},
		fasthitrecover_v={{{1,-6},{20,-30}},{{1,18*120},{20,18*120}}},
		lifereplenish_v={{{1,-10},{20,-15}},{{1,18*120},{20,18*120}}},
		deadlystrikeenhance_p={{{1,-6},{20,-35}},{{1,18*120},{20,18*120}}},
		skill_cost_v={{{1,60},{20,120}}},
	},
	tianren120={ --天忍120级技能
		
		attackspeed_v={{{1,1},{20,25},{21,26}},{{1,-1},{2,-1}}},
		lifemax_p={{{1,4},{20,80},{21,90}},{{1,-1},{2,-1}}},
		
	},

tttnd1={ --天外流星
		seriesdame={{{1,0},{10,0},{11,20},{20,60},{21,62}},{{1,3},{2,3}}},
		firedamage_v={
			[1]={{1,21*3/2},{10,914*3/2},{20,2910*3/2},{30,5820*3/2},{59,500*3/2},{60,700*3/2},{61,0},{62,0},{63,0}},
			[3]={{1,21*3/2},{10,914*3/2},{20,2910*3/2},{30,5820*3/2},{59,500*3/2},{60,700*3/2},{61,0},{62,0},{63,0}}
		},
fireres_p={{{1,-2},{20,-30},{30,-60},{31,-60}},{{1,18},{2,18}}},
		stunenhance_p={{{1,0},{10,1},{20,5},{21,5}}},
		skill_cost_v={{{1,20},{20,50}}},
		skill_eventskilllevel={{{1,0},{10,0},{11,11},{20,20}}},
lifereplenish_v={{{1,0},{20,0},{21,0},{30,0},{59,0},{60,0},{61,-3000},{62,-5000}},{{1,6*18},{60,6*18},{61,9},{62,9}}},
		skill_vanishedevent={
			[1]={{1,0},{10,0},{10,1},{20,1}},
			[3]={{1,363},{20,363}}
		},
		skill_showevent={{{1,0},{10,0},{10,8},{20,8}}},
	},
	tttnd2={ --业火焚城
		seriesdame={{{1,20},{20,60}},{{1,3},{2,3}}},
		firedamage_v={
			[1]={{1,41*3/2},{10,320*3/2},{20,1184*3/2},{30,2368*3/2},{59,200*3/2},{60,300},{61,0},{62,0},{63,0}},
			[3]={{1,41*3/2},{10,320*3/2},{20,1184*3/2},{30,2368*3/2},{59,200*3/2},{60,300},{61,0},{62,0},{63,0}}
		},
steallifeenhance_p={{{1,0},{20,0},{21,-15},{30,-60},{59,0},{60,0}},{{1,6*18},{60,6*18},{61,9},{62,9}}},
lifereplenish_v={{{1,0},{20,0},{21,-40},{30,-200},{59,0},{60,0},{61,-5000},{62,-7000}},{{1,6*18},{60,6*18},{61,9},{62,9}}},
	},
tttnk1={ --云龙击
		physicsenhance_p={{{1,15*3/2},{10,439*3/2},{20,933*3/2},{30,1866*3/2},{59,600},{60,800},{61,0},{62,0},{63,0}}},
		seriesdame={{{1,0},{10,0},{11,20},{20,60},{21,62}},{{1,3},{2,3}}},
		deadlystrike_p={{{1,4},{20,65},{21,66}}},
		firedamage_v={
			[1]={{1,6*3/2},{10,378*3/2},{20,1002*3/2},{30,2004*3/2},{59,600},{60,800},{61,0},{62,0},{63,0}},
			[3]={{1,6*3/2},{10,378*3/2},{20,1002*3/2},{30,2004*3/2},{59,600},{60,800},{61,0},{62,0},{63,0}}
		},
physicsres_p={{{1,-1},{20,-25},{30,-50},{31,-50}},{{1,18},{2,18}}},
fireres_p={{{1,-1},{20,-25},{30,-50},{31,-50}},{{1,18},{2,18}}},
		steallifeenhance_p={{{1,1},{20,16}}},
colddamage_v={
			[1]={{1,8*3/2},{30,115*3/2},{60,0*3/2},{61,0}},
[2]={{1,5},{30,25},{31,25}},
			[3]={{1,8*3/2},{30,115*3/2},{60,0*3/2},{61,0}}
		},
steallifeenhance_p={{{1,0},{20,0},{21,-15},{30,-70},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
lifereplenish_v={{{1,0},{20,0},{21,-40},{30,-200},{59,0},{60,0},{61,-4000},{62,-6000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		stealmanaenhance_p={{{1,1},{20,16}}},
		missle_speed_v={{{1,30},{20,30}}},
		missle_lifetime_v={{{1,4},{2,4}}},
		stunenhance_p={{{1,0},{10,1},{20,5},{21,5}}},
		skill_cost_v={{{1,30},{20,30}}},
skill_eventskilllevel={{{1,0},{10,0},{11,11},{20,20}}},
	},


       skill120={
                skill_cost_v={{{1,35},{20,86},{21,86}}},
                skill_mintimepercast_v={{{1,40*18},{20,20*18},{21,20*18}},{{1,40*18},{20,20*18},{21,20*18}}},
		skilllevelexp={{{1,18},{2,45},{3,90},{4,180},{5,360},{6,720},{7,1080},{8,1530},{9,2070},{10,3150},{11,4590},{12,6480},{13,8550},{14,11790},{15,16830},{16,21960},{17,32130},{18,46080},{19,89100},{20,89100},{21,89100}},{{1,0},{20,0}},{{1,140},{1,140}}},
                madness_p={{{1,35},{20,85},{21,85}},{{1,18},{20,4*18},{21,4*18}},{{1,479},{20,479}}},
                
	},
        skill120b={
                stateskilltime={{{1,1},{20,1}},{{1,18},{20,4*18},{21,4*18}}},
	},


	tianren150={ --150级技能
		skill_cost_v={{{1,100},{20,200},{21,220}},{{1,-1},{2,-1}}},
		fastwalkrun_p={{{1,-750},{20,-750},{21,-750}},{{1,18*1},{20,18*10}}},
		castspeed_v={{{1,-500},{20,-500}},{{1,18*1},{20,18*10}}},
                attackspeed_v={{{1,-500},{20,-500}},{{1,18*1},{20,18*10}}}
	},
}
-----------------------------------------------
--Create by yfeng 2004-05-20
-----------------------------------------------

-----------------------------------------------
--根据2个点，求线形函数f(x)=k*x+b
--y= (y2-y1)*(x-x1)/(x2-x1)+y1
--当x2=x1, 有x=c,该直线是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：
function Line(x,x1,y1,x2,y2)
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--根据2个点，求2次形函数f(x)=a*x2+c
--y= (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
--当x1或者x2 < 0 ,y =0
--当x2=x1, 有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Conic(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then 
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
end

-----------------------------------------------
--根据2个点，求-2次形函数f(x)=a*sqrt(x2)+c
--y=(y2-y1)*x/(sqrt(x2)-sqrt(x1))+y1-(y2-y1)/((sqrt(x2)-sqrt(x1))
--当x2或者x1<0, y=0,
--当x1=x2,有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Extrac(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then 
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--描绘连接线:Link(x,points)
--根据points提供的一系列点，用相邻的两个点描绘曲线
--return y值
--x 输入值
--points 点集合
--形如：points是形如{{x1,y1,func=xxx},{x2,y2,func=xxx},...{xn,yn,func=xxx}}的映射
function Link(x,points)
	num = getn(points)
	if(num<2) then
		return -1
	end
	for i=1,num do
		if(points[i][3]==nil) then
			points[i][3]=Line
		end
	end
	if(x < points[1][1]) then
		return points[1][3](x,points[1][1],points[1][2],points[2][1],points[2][2])
	end
	if(x > points[num][1]) then
		return points[num][3](x,points[num-1][1],points[num-1][2],points[num][1],points[num][2])
	end
	
	c = 2
	for i=2,num do
		if((x >= points[i-1][1]) and (x <= points[i][1])) then
			c = i
			break
		end
	end
	return points[c][3](x,points[c-1][1],points[c-1][2],points[c][1],points[c][2])
end

------------------------------------------------------
--技能设定格式如下：
--SKILLS={
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		。。。。。
--	}，
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		。。。。。
--	}，
--	。。。。。
--}
--如：
--SKILLS={
--	Sanhuan-taoyue={
--		physicsenhance_p={
--			[1]={{1,50},{20,335}},--魔法属性physicsenhance_p参数1，1级时为35，20级时为335，曲线不填，默认线形
--			[2]={{1,0},{20,0}},
--		},--没有[3]，表示魔法属性physicsenhance_p参数2，默认为任何时候都是0
--		lightingdamage_v={
--			[1]={{1,65},{20,350}},
--			[3]={{1,65},{20,350}},
--		}
--	}
--}
--以上描述技能“三环套月”的魔法属性和数值
-----------------------------------------------------------
--函数GetSkillLevelData(levelname, data, level)
--levelname：魔法属性名称
--data：技能名称
--level：技能等级
--return：当技能名称为data，技能等级为level
--			时的魔法属性levelname所需求的三个参数的具体值
-----------------------------------------------------------
function GetSkillLevelData(levelname, data, level)
	if(data==nil) then
		return ""
	end
	if(data == "") then
		return ""
	end
	if(SKILLS[data]==nil) then
		return ""
	end
	if(SKILLS[data][levelname]==nil) then
		return ""
	end
	if(type(SKILLS[data][levelname]) == "function") then
		return SKILLS[data][levelname](level)
	end
	if(SKILLS[data][levelname][1]==nil) then
		SKILLS[data][levelname][1]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][2]==nil) then
		SKILLS[data][levelname][2]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][3]==nil) then
		SKILLS[data][levelname][3]={{0,0},{20,0}}
	end
	p1=floor(Link(level,SKILLS[data][levelname][1]))
	p2=floor(Link(level,SKILLS[data][levelname][2]))
	p3=floor(Link(level,SKILLS[data][levelname][3]))
	return Param2String(p1,p2,p3)
end;


function Param2String(Param1, Param2, Param3)
return Param1..","..Param2..","..Param3
end;

