--迭代函数，用于计算技能熟练度
--具体方法：
--根据1级熟练度，升级加速度，级数，重复伤害次数，范围，计算出相应等级熟练度
-- SkillExp(i) = Exp1*a^(i-1)*time*range
function SkillExpFunc(Exp0,a,Level,Time,Range)
	return floor(Exp0*(a^(Level-1))*Time*Range/2)
end


SKILLS={
	---天王帮
	zhanlong_jue={ --斩龙诀
		physicsenhance_p={{{1,80},{20,185}}},
		ignoredefense_p={{{1,5},{20,20}}},
		seriesdame={{{1,10},{20,20}},{{1,0},{2,0}}},
skill_eventskilllevel={{{1,1},{2,2}}},
lifereplenish_v={{{1,0},{60,0},{61,-800}},{{1,9*18},{60,9*18},{61,9},{62,9}}},
				colddamage_v={
			[1]={{1,0},{60,0},{61,0},{62,0}},
			[3]={{1,0},{60,0},{61,0},{62,0}}
		},
		deadlystrike_p={{{1,6},{20,10}}},
		addskilldame1={{{1,345},{20,345}},{{1,1},{20,50}}},
		addskilldame2={{{1,325},{20,325}},{{1,1},{20,35}}},
		addskilldame3={{{1,346},{20,346}},{{1,1},{20,50}}},
		addskilldame4={{{1,326},{20,326}},{{1,1},{20,35}}},
		
		
		
		
		missle_speed_v={{{1,18},{20,18}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_attackradius={{{1,54},{20,54}}},
		skill_cost_v={{{1,3},{20,6}}},
changecamp_b={{{1,0},{20,5},{21,5}}},
	},
	tianwang_qiangfa={ --天王枪法
		addphysicsdamage_p={{{1,25},{20,315}},{{1,-1},{2,-1}},{{1,3},{2,3}}},
		attackratingenhance_p={{{1,75},{20,270}},{{1,-1},{2,-1}}},
		deadlystrikeenhance_p={{{1,2},{20,15}},{{1,-1},{2,-1}}},
knockbackenhance_p={{{1,0},{20,4},{21,4}}}
	},
	tianwang_daofa={ --天王刀法
		addphysicsdamage_p={{{1,50},{20,300}},{{1,-1},{2,-1}},{{1,1},{2,1}}},
		attackratingenhance_p={{{1,15},{20,72}},{{1,-1},{2,-1}}},
		deadlystrikeenhance_p={{{1,2},{20,15}},{{1,-1},{2,-1}}},
knockbackenhance_p={{{1,0},{20,4},{21,4}}}
	},
	tianwang_chuifa={ --天王锤法
		addphysicsdamage_p={{{1,25},{20,275}},{{1,-1},{2,-1}},{{1,4},{2,4}}},
		attackratingenhance_p={{{1,15},{20,72}},{{1,-1},{2,-1}}},
		deadlystrikeenhance_p={{{1,2},{20,15}},{{1,-1},{2,-1}}},
knockbackenhance_p={{{1,0},{20,4},{21,4}}}
	},
	huifeng_luoyan={ --回风落雁
		seriesdame={{{1,1},{20,10}},{{1,0},{2,0}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		physicsenhance_p={{{1,80},{20,215}}},
		attackrating_p={{{1,10},{20,147}}},
		addskilldame1={{{1,347},{20,347}},{{1,1},{20,60}}},
		addskilldame2={{{1,41},{20,41}},{{1,1},{20,35}}},
		addskilldame3={{{1,348},{20,348}},{{1,1},{20,60}}},
		addskilldame4={{{1,226},{20,226}},{{1,1},{20,35}}},
		
		
		missle_speed_v={{{1,18},{20,18}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_attackradius={{{1,54},{20,54}}},
		skill_cost_v={{{1,4},{20,10}}},
changecamp_b={{{1,0},{20,5},{21,5}}},
	},
	xingyun_jue={ --行云诀
		physicsenhance_p={{{1,30},{20,255}}},
		ignoredefense_p={{{1,10},{20,35}}},
		seriesdame={{{1,5},{20,30}},{{1,0},{2,0}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		colddamage_v={
			[1]={{1,5},{20,50}},
			[3]={{1,100},{20,100}}
		},
		deadlystrike_p={{{1,8},{20,20}}},
		addskilldame1={{{1,345},{20,345}},{{1,1},{20,55}}},
		addskilldame2={{{1,346},{20,346}},{{1,1},{20,55}}},
		missle_speed_v={{{1,22},{20,22}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_attackradius={{{1,66},{20,66}}},
		skill_cost_v={{{1,3},{20,7}}},
slowmissle_b={{{1,0},{20,3},{21,3}}}
	},
	wuxin_zhan={ --无心斩
		physicsenhance_p={{{1,65},{20,453}}},
		seriesdame={{{1,10},{20,50}},{{1,0},{2,0}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		deadlystrike_p={{{1,4},{20,25},{21,25}}},
		addskilldame1={{{1,342},{20,342}},{{1,1},{20,80}}},
		addskilldame2={{{1,343},{20,343}},{{1,1},{20,80}}},
		
	colddamage_v={
			[1]={{1,0},{60,0},{61,0},{62,0}},
			[3]={{1,0},{60,0},{61,0},{62,0}}
		},
lifereplenish_v={{{1,0},{60,0},{61,-1500}},{{1,9*18},{60,9*18},{61,9},{62,9}}},
		missle_speed_v={{{1,26},{20,26}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_attackradius={{{1,78},{20,78}}},
		skill_cost_v={{{1,10},{20,20}}},
slowmissle_b={{{1,0},{20,7},{21,7}}}
	},
	jingxin_jue={ --静心诀
		attackratingenhance_p={{{1,45},{20,400}},{{1,18*120},{20,18*180}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		skill_cost_v={{{1,5},{20,20}}}
	},
	jinglei_zhan={ --惊雷斩
		physicsenhance_p={{{1,40},{20,200}}},
		seriesdame={{{1,1},{20,10}},{{1,0},{2,0}}},
		skill_eventskilllevel={{{1,1},{2,2}}},
		
		addskilldame1={{{1,342},{20,342}},{{1,1},{20,60}}},
		addskilldame3={{{1,343},{20,343}},{{1,1},{20,60}}},
		addskilldame2={{{1,32},{20,32}},{{1,1},{20,35}}},
		
		missle_speed_v={{{1,18},{20,18}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_attackradius={{{1,54},{20,54}}},
		skill_cost_v={{{1,5},{20,10}}},
changecamp_b={{{1,0},{20,5},{21,5}}},
	},
	yangguan_sandie={ --阳关三叠
		physicsenhance_p={{{1,130},{20,375}}},
		seriesdame={{{1,5},{20,30}},{{1,0},{2,0}}},
		attackrating_p={{{1,10},{20,100}}},
skill_eventskilllevel={{{1,1},{2,2}}},
lifereplenish_v={{{1,0},{60,0},{61,-900}},{{1,9*18},{60,9*18},{61,9},{62,9}}},
		addskilldame1={{{1,347},{20,347}},{{1,1},{20,65}}},
		
		addskilldame2={{{1,348},{20,348}},{{1,1},{20,65}}},
		missle_speed_v={{{1,22},{20,22}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_attackradius={{{1,66},{20,66}}},
		skill_cost_v={{{1,12},{20,22}}},
slowmissle_b={{{1,0},{20,3},{21,3}}}
	},
	tianwang_zhanyi={ --天王战意
		lifemax_p={{{1,21},{30,185}},{{1,-1},{30,-1}}},
		deadlystrikeenhance_p={{{1,5},{30,45}},{{1,-1},{30,-1}}},
		attackspeed_v={{{1,5},{30,65}},{{1,-1},{30,-1}}},
		skill_cost_v={{{1,10},{30,50}}}
	},
	pofeng_zhan={ --泼风斩
		physicsenhance_p={{{1,120},{20,275}}},
		seriesdame={{{1,5},{20,30}},{{1,0},{2,0}}},
		addskilldame1={{{1,342},{20,342}},{{1,1},{20,70}}},
		addskilldame2={{{1,343},{20,343}},{{1,1},{20,70}}},
		
			missle_speed_v={{{1,22},{20,22}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_attackradius={{{1,66},{20,66}}},
		skill_cost_v={{{1,8},{20,12}}},
slowmissle_b={{{1,0},{20,3},{21,3}}}
	},
	duanhun_ci={ --断魂刺
		physicsenhance_p={{{1,25},{20,215}}},
		seriesdame={{{1,1},{20,50}},{{1,0},{2,0}}},
		stun_p={{{1,16},{20,35}},{{1,1},{20,9}}},
		skill_param1_v={{{1,4},{5,12},{20,24},{31,31},{32,31}}},
		skill_param2_v={{{1,18},{20,1},{21,1}}},
		deadlystrike_p={{{1,4},{20,80}}},
		skilladdmissles={{{1,1},{2,1}},{{1,30},{20,52}}},
		missle_speed_v={{{1,22},{20,30},{21,30}}},
		skill_attackradius={{{1,22*16},{20,30*16},{21,30*16}}},
skill_eventskilllevel={{{1,1},{50,50},{51,0},{52,0}}},
		skill_cost_v={{{1,10},{20,20}}}
	},
tangtocdoluot={
fastwalkrun_p={{{1,200},{20,800},{21,500}},{{1,54},{2,54}}},
freezetimereduce_p={{{1,300},{2,300}},{{1,54},{2,54}}},
stuntimereduce_p={{{1,300},{2,300}},{{1,54},{2,54}}},
poisontimereduce_p={{{1,200},{2,200}},{{1,54},{2,54}}},
fasthitrecover_v={{{1,200},{2,200}},{{1,54},{2,54}}},
fireres_p={{{1,-100},{2,-100}},{{1,54},{2,54}}},
		},
	xuezhan_bafang={ --血战八方
		physicsenhance_p={{{1,60},{20,723}}},
		seriesdame={{{1,20},{20,50},{21,52}},{{1,0},{2,0}}},
skill_eventskilllevel={{{1,1},{2,2}}},
		attackrating_p={{{1,75},{20,320}}},
		deadlystrike_p={{{1,4},{20,25}}},
		addskilldame1={{{1,347},{20,347}},{{1,1},{20,70}}},
		addskilldame2={{{1,348},{20,348}},{{1,1},{20,70}}},
		missle_speed_v={{{1,26},{20,26}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_attackradius={{{1,78},{20,78}}},
		skill_cost_v={{{1,11},{20,45}}},
slowmissle_b={{{1,0},{20,7},{21,7}}}
	},
	jinzhong_zhao={ --金钟罩
		physicsres_p={{{1,12},{20,50}},{{1,18*120},{20,18*180}}},
		coldres_p={{{1,7},{20,45}},{{1,18*120},{20,18*180}}},
		fireres_p={{{1,-5},{20,-15},{21,-15}},{{1,18*120},{20,18*180}}},
		skill_eventskilllevel={{{1,1},{2,2}}},
		skill_cost_v={{{1,12},{20,40}}}
	},
	chenglong_jue={ --乘龙诀
		physicsenhance_p={{{1,40},{20,495}}},
		ignoredefense_p={{{1,38},{20,80},{21,82}}},
		seriesdame={{{1,10},{20,50}},{{1,0},{2,0}}},
skill_eventskilllevel={{{1,1},{50,50},{51,0},{52,0}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{50,0},{51,20}},
			[3]={{1,0},{2,0}}
		},
		deadlystrike_p={{{1,5},{20,40}}},
		addskilldame1={{{1,345},{20,345}},{{1,1},{20,60}}},
		addskilldame2={{{1,346},{20,346}},{{1,1},{20,60}}},
		missle_speed_v={{{1,26},{20,26}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_attackradius={{{1,78},{20,78}}},
		skill_cost_v={{{1,10},{20,16}}},
slowmissle_b={{{1,0},{20,7},{21,7}}}
	},
	potian_zhan={ --破天斩
		physicsenhance_p={{{1,176},{15,756},{20,1703}}},
		seriesdame={{{1,20},{15,20},{20,60},{21,62}},{{1,0},{2,0}}},
		attackrating_p={{{1,35},{20,215*3/2}}},
		 skilllevelexp={{{1,22*15*3},{2,55*15*3},{3,110*15*3},{4,220*15*3},{5,440*15*3},{6,880*15*3},{7,1320*15*3},{8,1870*15*3},{9,2530*15*3},{10,3850*15*3},{11,5610*15*3},{12,7920*15*3},{13,10450*15*3},{14,14410*15*3},{15,20570*15*3},{16,26840*15*3},{17,39270*15*3},{18,56320*15*3},{19,108900*15*3},{20,0}},{{1,342},{20,342}},{{1,192},{1,192}}},
		deadlystrike_p={{{1,4},{20,25}}},
		missle_speed_v={{{1,30},{20,30}}},
		missle_lifetime_v={{{1,4},{20,4}}},
skill_attackradius={{{1,90},{20,90}}},
physicsres_p={{{1,-1},{20,-20},{30,-40},{31,-40}},{{1,18},{2,18}}},
skill_eventskilllevel={{{1,1},{2,2}}},
lifereplenish_v={{{1,0},{60,0},{61,-5000},{62,-8000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
fastwalkrun_p={{{1,0},{20,0},{21,-10},{30,-40},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
lifemax_v={{{1,0},{20,0},{21,-500},{30,-2000},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		skill_cost_v={{{1,15},{20,30}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{50,0},{51,25}},
			[3]={{1,0},{2,0}}
		},
	},
	zhuixing_zhuyue={ --追星逐月
		physicsenhance_p={{{1,126},{15,504},{20,960}}},
		seriesdame={{{1,20},{15,20},{20,60},{21,62}},{{1,0},{2,0}}},
attackrating_p={{{1,95},{20,360}}},
	 skilllevelexp={{{1,22*15*3},{2,55*15*3},{3,110*15*3},{4,220*15*3},{5,440*15*3},{6,880*15*3},{7,1320*15*3},{8,1870*15*3},{9,2530*15*3},{10,3850*15*3},{11,5610*15*3},{12,7920*15*3},{13,10450*15*3},{14,14410*15*3},{15,20570*15*3},{16,26840*15*3},{17,39270*15*3},{18,56320*15*3},{19,108900*15*3},{20,0}},{{1,347},{20,347}},{{1,191},{1,191}}},
		skill_attackradius={{{1,90},{20,90}}},
		deadlystrike_p={{{1,4},{20,25}}},
lifereplenish_v={{{1,0},{60,0},{61,-6000},{62,-9000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
physicsres_p={{{1,-1},{20,-20},{30,-40},{31,-40}},{{1,18},{2,18}}},
skill_eventskilllevel={{{1,1},{2,2}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{50,0},{51,25}},
			[3]={{1,0},{2,0}}
		},
fastwalkrun_p={{{1,0},{20,0},{21,-20},{30,-70},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
lifemax_v={{{1,0},{20,0},{21,-500},{30,-2000},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		missle_speed_v={{{1,30},{20,30}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_cost_v={{{1,10},{20,65}}},
	},
tanghaitvb={ --追风诀
		physicsenhance_p={{{1,1000},{25,1000},{50,1000}}},
		seriesdame={{{1,1500},{15,20},{25,100},{26,1500}},{{1,0},{2,0}}},
		ignoredefense_p={{{1,50},{20,50},{21,50},{22,50},{23,50},{24,50}}},
		colddamage_v={
			[1]={{1,20050},{50,20050}},
			[3]={{1,20050},{50,20050}}
		},
		deadlystrike_p={{{1,10},{20,40}}},
physicsres_p={{{1,-1},{30,-20}},{{1,9},{2,9}}},
		missle_speed_v={{{1,30},{20,30}}},
		missle_lifetime_v={{{1,15},{20,15}}},
		skill_attackradius={{{1,54},{20,54}}},
		skill_cost_v={{{1,0},{20,0}}}
	},
	zhuifeng_jue={ --追风诀
		physicsenhance_p={{{1,63},{15,352},{20,957}}},
		seriesdame={{{1,20},{15,20},{20,60},{21,62}},{{1,0},{2,0}}},
		skilllevelexp={{{1,22*15*3},{2,55*15*3},{3,110*15*3},{4,220*15*3},{5,440*15*3},{6,880*15*3},{7,1320*15*3},{8,1870*15*3},{9,2530*15*3},{10,3850*15*3},{11,5610*15*3},{12,7920*15*3},{13,10450*15*3},{14,14410*15*3},{15,20570*15*3},{16,26840*15*3},{17,39270*15*3},{18,56320*15*3},{19,108900*15*3},{20,0}},{{1,345},{20,345}},{{1,193},{1,193}}},
skill_attackradius={{{1,90},{20,90}}},
		deadlystrike_p={{{1,5},{20,40}}},
		ignoredefense_p={{{1,12},{20,90},{21,94},{22,98},{23,99},{24,99}}},
lifereplenish_v={{{1,0},{60,0},{61,-5000},{62,-8000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
skill_eventskilllevel={{{1,1},{2,2}}},
fastwalkrun_p={{{1,0},{20,0},{21,-20},{30,-60},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
lifemax_v={{{1,0},{20,0},{21,-300},{30,-1500},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		missle_speed_v={{{1,30},{20,30}}},
physicsres_p={{{1,-1},{20,-20},{30,-40},{31,-40}},{{1,18},{2,18}}},
	colddamage_v={
			[1]={{1,1},{20,50}},
			[3]={{1,5},{20,250}}
		},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_cost_v={{{1,10},{20,30}}}
	},
dailucthanchuy={ --追风诀
		physicsenhance_p={{{1,25},{20,400},{49,7000},{50,10000},{55,20000}}},
		seriesdame={{{1,50},{50,150}},{{1,0},{2,0}}},
		ignoredefense_p={{{1,12},{20,20},{21,21},{22,22},{49,40},{50,50},{55,50}}},
		colddamage_v={
			[1]={{1,1},{20,50}},
			[3]={{1,5},{20,250}}
		},
		deadlystrike_p={{{1,1},{50,50}}},
		missle_speed_v={{{1,18},{20,18}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_attackradius={{{1,54},{20,54}}},
		skill_cost_v={{{1,0},{20,0}}}
	},

tttvd={ --破天斩
		physicsenhance_p={{{1,35*5/2},{10,388*5/2},{20,1203*5/2},{30,2406*5/2},{59,400},{60,600},{61,0},{62,0}}},
		seriesdame={{{1,0},{10,0},{11,20},{20,60},{21,62}},{{1,0},{2,0}}},
		deadlystrike_p={{{1,4},{20,25},{21,26}}},
		missle_speed_v={{{1,30},{20,30}}},
		missle_lifetime_v={{{1,4},{20,4}}},
physicsres_p={{{1,-2},{20,-30},{30,-60},{31,-60}},{{1,18},{2,18}}},
skill_eventskilllevel={{{1,1},{2,2}}},
lifereplenish_v={{{1,0},{60,0},{61,-5000},{62,-8000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
fastwalkrun_p={{{1,0},{20,0},{21,-10},{30,-40},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
lifemax_v={{{1,0},{20,0},{21,-500},{30,-2000},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		skill_cost_v={{{1,15},{20,30}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{59,25},{60,25}},
			[3]={{1,0},{2,0}}
		},
	},
	tttvt={ --追星逐月
		physicsenhance_p={{{1,50*3/2},{10,381*3/2},{20,1123*3/2},{30,2246*3/2},{59,320},{60,480},{61,0},{62,0}}},
		seriesdame={{{1,0},{10,0},{11,20},{20,60},{21,62}},{{1,0},{2,0}}},
attackrating_p={{{1,95},{20,360}}},
		deadlystrike_p={{{1,4},{20,25},{21,26}}},
lifereplenish_v={{{1,0},{60,0},{61,-6000},{62,-9000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
physicsres_p={{{1,-2},{20,-30},{30,-60},{31,-60}},{{1,18},{2,18}}},
skill_eventskilllevel={{{1,1},{2,2}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{59,25},{60,25}},
			[3]={{1,0},{2,0}}
		},
fastwalkrun_p={{{1,0},{20,0},{21,-20},{30,-70},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
lifemax_v={{{1,0},{20,0},{21,-500},{30,-2000},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		missle_speed_v={{{1,30},{20,30}}},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_cost_v={{{1,10},{20,65}}},
	},
tttvc={ --追风诀
		physicsenhance_p={{{1,25*3/2},{10,380*3/2},{20,1007*3/2},{30,2014*3/2},{59,400},{60,600},{61,0},{62,0}}},
		seriesdame={{{1,0},{10,0},{11,20},{20,60},{21,62}},{{1,0},{2,0}}},
		deadlystrike_p={{{1,5},{20,40},{21,41}}},
		ignoredefense_p={{{1,12},{20,90},{21,90}}},
lifereplenish_v={{{1,0},{60,0},{61,-5000},{62,-8000}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
skill_eventskilllevel={{{1,1},{2,2}}},
fastwalkrun_p={{{1,0},{20,0},{21,-20},{30,-60},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
lifemax_v={{{1,0},{20,0},{21,-300},{30,-1500},{59,0},{60,0}},{{1,3*18},{60,3*18},{61,9},{62,9}}},
		missle_speed_v={{{1,30},{20,30}}},
physicsres_p={{{1,-2},{20,-30},{30,-60},{31,-60}},{{1,18},{2,18}}},
colddamage_v={
			[1]={{1,0},{2,0}},
[2]={{1,0},{30,0},{59,25},{60,25}},
			[3]={{1,0},{2,0}}
		},
		missle_lifetime_v={{{1,4},{20,4}}},
		skill_cost_v={{{1,10},{20,30}}}
	},

	daoxutian={ --倒虚天
		
		allresmax_p={{{1,0},{20,2},{21,3}},{{1,-1},{2,-1}}},
		fastwalkrun_p={{{1,5},{20,80},{21,85}},{{1,-1},{2,-1}}},
		
	},
      skill120={
                stateskilltime={{{1,1},{20,1}},{{1,-1},{2,-1}}},
		allres_p={{{1,1},{20,10},{21,10}},{{1,-1},{2,-1}}},
                allresmax_p={{{1,1},{20,5},{21,5}},{{1,-1},{2,-1}}},
                lifereplenishadd_p={{{1,3},{20,35},{21,35}},{{1,-1},{2,-1}}},
		skilllevelexp={{{1,18},{2,45},{3,90},{4,180},{5,360},{6,720},{7,1080},{8,1530},{9,2070},{10,3150},{11,4590},{12,6480},{13,8550},{14,11790},{15,16830},{16,21960},{17,32130},{18,46080},{19,89100},{20,89100},{21,89100}},{{1,0},{20,0}},{{1,140},{1,140}}},
		buffemtyres_p={{{1,15},{20,89},{21,89}},{{1,474},{20,474}},{{1,1},{20,20}}},
	},
      skill120b={
                stateskilltime={{{1,1},{20,1}},{{1,18},{2,18}}},
	},
	tianwang150={ --150级技能
		skill_cost_v={{{1,100},{20,200},{21,220}},{{1,-1},{2,-1}}},
		lifereplenish_v={{{1,100},{20,1000},{21,1100}},{{1,18*120},{20,18*120}}},
		allresmax_p={{{1,1},{20,3},{21,3}},{{1,18*120},{20,18*120}}},
steallifeenhance_p={{{1,5},{20,50},{21,51}},{{1,18*120},{20,18*120}}},
                addskilldame3={{{1,5000},{20,500000},{21,550000}},{{1,18*120},{20,18*120}}}
	},
}
-----------------------------------------------
--Create by yfeng 2004-05-20
-----------------------------------------------

-----------------------------------------------
--根据2个点，求线形函数f(x)=k*x+b
--y= (y2-y1)*(x-x1)/(x2-x1)+y1
--当x2=x1, 有x=c,该直线是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：
function Line(x,x1,y1,x2,y2)
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--根据2个点，求2次形函数f(x)=a*x2+c
--y= (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
--当x1或者x2 < 0 ,y =0
--当x2=x1, 有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Conic(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then 
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
end

-----------------------------------------------
--根据2个点，求-2次形函数f(x)=a*sqrt(x2)+c
--y=(y2-y1)*x/(sqrt(x2)-sqrt(x1))+y1-(y2-y1)/((sqrt(x2)-sqrt(x1))
--当x2或者x1<0, y=0,
--当x1=x2,有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Extrac(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then 
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--描绘连接线:Link(x,points)
--根据points提供的一系列点，用相邻的两个点描绘曲线
--return y值
--x 输入值
--points 点集合
--形如：points是形如{{x1,y1,func=xxx},{x2,y2,func=xxx},...{xn,yn,func=xxx}}的映射
function Link(x,points)
	num = getn(points)
	if(num<2) then
		return -1
	end
	for i=1,num do
		if(points[i][3]==nil) then
			points[i][3]=Line
		end
	end
	if(x < points[1][1]) then
		return points[1][3](x,points[1][1],points[1][2],points[2][1],points[2][2])
	end
	if(x > points[num][1]) then
		return points[num][3](x,points[num-1][1],points[num-1][2],points[num][1],points[num][2])
	end
	
	c = 2
	for i=2,num do
		if((x >= points[i-1][1]) and (x <= points[i][1])) then
			c = i
			break
		end
	end
	return points[c][3](x,points[c-1][1],points[c-1][2],points[c][1],points[c][2])
end

------------------------------------------------------
--技能设定格式如下：
--SKILLS={
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		。。。。。
--	}，
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，	
--		}，
--		。。。。。
--	}，
--	。。。。。
--}
--如：
--SKILLS={
--	Sanhuan-taoyue={
--		physicsenhance_p={
--			[1]={{1,50},{20,335}},--魔法属性physicsenhance_p参数1，1级时为35，20级时为335，曲线不填，默认线形
--			[2]={{1,0},{20,0}},
--		},--没有[3]，表示魔法属性physicsenhance_p参数2，默认为任何时候都是0
--		lightingdamage_v={
--			[1]={{1,65},{20,350}},
--			[3]={{1,65},{20,350}},
--		}
--	}
--}
--以上描述技能“三环套月”的魔法属性和数值
-----------------------------------------------------------
--函数GetSkillLevelData(levelname, data, level)
--levelname：魔法属性名称
--data：技能名称
--level：技能等级
--return：当技能名称为data，技能等级为level
--			时的魔法属性levelname所需求的三个参数的具体值
-----------------------------------------------------------
function GetSkillLevelData(levelname, data, level)
	if(data==nil) then
		return ""
	end
	if(data == "") then
		return ""
	end
	if(SKILLS[data]==nil) then
		return ""
	end
	if(SKILLS[data][levelname]==nil) then
		return ""
	end
	if(SKILLS[data][levelname][1]==nil) then
		SKILLS[data][levelname][1]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][2]==nil) then
		SKILLS[data][levelname][2]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][3]==nil) then
		SKILLS[data][levelname][3]={{0,0},{20,0}}
	end
	p1=floor(Link(level,SKILLS[data][levelname][1]))
	p2=floor(Link(level,SKILLS[data][levelname][2]))
	p3=floor(Link(level,SKILLS[data][levelname][3]))
	return Param2String(p1,p2,p3)
end;


function Param2String(Param1, Param2, Param3)
return Param1..","..Param2..","..Param3
end;

