PHANTHUONG={
	[1]={
		[1] = "75ÙQu¶ngÙSiªu",
		[2] = 9999
	},
	[2]={
		[1] = "B»ngÙ§ÊtÙMòiÙ@",
		[2] = 2
	},
	[3]={
		[1] = "C¸iBangRång",
		[2] = 3
	},
	[4]={
		[1] = "Thinhvl",
		[2] = 4
	},
	[5]={
		[1] = "L·oÙPhËtÙGia",
		[2] = 4
	},
	[6]={
		[1] = "¦ngHoµngCãc",
		[2] = 5
	},
	[7]={
		[1] = "§­êngV¨nM«n",
		[2] = 5
	},
	[8]={
		[1] = "100USD",
		[2] = 5
	},
	[9]={
		[1] = "Chivas21",
		[2] = 5
	},
	[10]={
		[1] = "DepGaiCoKhac",
		[2] = 5
	},
	[11]={
		[1] = "B»ngÙ§ÊtÙMòiÙ@",
		[2] = 1
	},
	[12]={
		[1] = "75ÙQu¶ngÙSiªu",
		[2] = 9999
	},
	[13]={
		[1] = "TuyÒnÙC¬ÙTöÙ",
		[2] = 9999
	},
	[14]={
		[1] = "*AÙConÙChãÙNµy*",
		[2] = 4
	},
	[15]={
		[1] = "HáaÙV©nÙTµÙThÇn",
		[2] = 4
	},
	[16]={
		[1] = "TINHMOTDEM",
		[2] = 5
	},
	[17]={
		[1] = "ma?kalele",
		[2] = 5
	},
	[18]={
		[1] = "PhËtÙOnline",
		[2] = 5
	},
	[19]={
		[1] = "AnhÙM­êiÙBaÙPK+",
		[2] = 5
	},
	[20]={
		[1] = "LÙoÙnÙGÙ92",
		[2] = 5
	},
	[21]={
		[1] = "75ÙQu¶ngÙSiªu",
		[2] = 9999
	},
	[22]={
		[1] = "Chau100KG",
		[2] = 9999
	},
	[23]={
		[1] = "TinDer@@",
		[2] = 3
	},
	[24]={
		[1] = "TuyÒnÙC¬ÙTöÙ",
		[2] = 9999
	},
	[25]={
		[1] = "GiangÙB¸nÙNhang",
		[2] = 4
	},
	[26]={
		[1] = "ThiÙNg¸o§¸",
		[2] = 5
	},
	[27]={
		[1] = "§­êng.§an",
		[2] = 9999
	},
	[28]={
		[1] = "HáaÙV©nÙTµÙThÇn",
		[2] = 5
	},
	[29]={
		[1] = "42493XXX",
		[2] = 5
	},
	[30]={
		[1] = "~TiÓuÙC«ÙN­¬ng~",
		[2] = 5
	}
}