PHAN_THUONG={
	[1]={
		[1] = "YÕnTamN­¬ng",
		[2] = 20
	},
	[2]={
		[1] = "TÇmÙHoaÿVÊnÙLiÔu",
		[2] = 4
	},
	[3]={
		[1] = "zC¸tBôiz",
		[2] = 20
	},
	[4]={
		[1] = "V«DanhT¨ng",
		[2] = 20
	},
	[5]={
		[1] = "Luc*Tuyet*Ky",
		[2] = 20
	},
	[6]={
		[1] = "***CRV***",
		[2] = 4
	},
	[7]={
		[1] = "SuÙRiÙPK",
		[2] = 20
	},
	[8]={
		[1] = "HN_Baby",
		[2] = 20
	},
	[9]={
		[1] = "B¨ngThÇn",
		[2] = 20
	},
	[10]={
		[1] = "CæÙB¸ch",
		[2] = 10
	},
	[11]={
		[1] = "M¸uÙKinhÙD¬ÙL¾m",
		[2] = 10
	},
	[12]={
		[1] = "QuûÙKiÕmÙSÇu",
		[2] = 10
	},
	[13]={
		[1] = "BÐ Mïa Thu",
		[2] = 20
	},
	[14]={
		[1] = "BooMBooM",
		[2] = 20
	},
	[15]={
		[1] = "XxHoaB¶oNgäcXx",
		[2] = 20
	}
}