--description: 唐门20级任务 怪石阵石屋门前小石碑
--author: yuanlan	
--date: 2003/3/11


function main()

UTask_tm = GetTask(2);

if (UTask_tm == 22) then 
	Say("先在这谷中找到四字口诀再说！", 0)
	SetTask(2, 23)
end;	
	
if (UTask_tm == 23) then 
	if (HaveItem("怪石阵丝帕一") == 1) and (HaveItem("怪石阵丝帕二") == 1) and (HaveItem("怪石阵丝帕三") == 1) and (HaveItem("怪石阵丝帕四") == 1) then
		Talk(9, "", "唐幽：你既然找到了'擅闯者死'四个字，为什么还敢停留？难道天下有不怕死的人吗？", "玩家：天下没有不怕死的人，但是亲人生而不能相见，岂不是比死更难过？", "唐幽：你到底是什么人！", "玩家：晚辈是唐门弟子，专程来请师姑回唐门，与掌门兄妹团聚！", "唐幽：我没有什么兄长！我的亲人都死光了！当年我被赶出家门的时候，可没有一个兄长为我说过好话！那时我就发誓，今生绝不再踏进唐门半步！", "玩家：如果师姑真的对唐门没有半点留恋的话，又为什么要在这竹海后山隐居呢？", "唐幽：……", "玩家：师姑，这么多年来，掌门一直十分懊悔当年没有阻止师祖将您赶出家门，您为什么不给他一次补偿的机会呢？何况兄妹乃是骨肉至亲，何必因为一时意气，而弄得抱憾终生呢？", "唐幽：你不必再罗嗦！好，我就给他一次机会，免得说我冷酷无情。当年我离开家门时，一气之下将出生时爹送给我的金项圈扔进了翡翠湖，你如果能给我找回金项圈，我就和你回去！")
   		DelItem("怪石阵丝帕一")	
		DelItem("怪石阵丝帕二")
		DelItem("怪石阵丝帕三")
		DelItem("怪石阵丝帕四")
		SetTask(2, 24)
	else
		Say("先在这谷中找到四字口诀再说！", 0)		
	end;	
end;

	   	
if (UTask_tm == 24) then 
	if (HaveItem("金项圈") == 1) then
		Talk(2, "", "玩家：师姑，弟子已经在翡翠湖找到了金项圈，师姑愿意跟弟子回去了吗？", "唐幽：……你把金项圈交给我大哥，他见到项圈就知道我已经原谅他了。")
  		SetTask(2, 26)
	else								--没有得到或者丢失，金项圈可以反复打
		Say("唐幽：如果你能去翡翠湖替我找回金项圈，我就和你回去！", 0)
	end;
end;			  		


if (UTask_tm == 26) then 
	Say("唐幽：你把金项圈交给我大哥，他见到项圈就知道我已经原谅他了。", 0)
end;


if (UTask_tm == 30) then 
	Say("唐幽：我一个人清静惯了，不喜被人打扰，往事已了，多说无益，你回去吧！", 0)
end;


end;
	   	





