DSTOP={
	[1]={
		[1]={
			[1] = "hocsinhvietnam",
			[2] = "ThaiVuong",
			[3] = 9472403
		},
		[2]={
			[1] = "betbet",
			[2] = "TÇmÙHoaÙVÊnÙLiÔu",
			[3] = 2572503
		},
		[3]={
			[1] = "bangma1",
			[2] = "CøÙ§ÓÙ§­êngÙT¨ng",
			[3] = 212603
		}
	},
	[2]={
		[1]={
			[1] = "chamkakatvb",
			[2] = "• YaKuZa •",
			[3] = 8382503
		},
		[2]={
			[1] = "shin1",
			[2] = "**SHIN**",
			[3] = 17152503
		},
		[3]={
			[1] = "diablo4t",
			[2] = "SoMayQua",
			[3] = 5562703
		}
	},
	[3]={
		[1]={
			[1] = "bukhoi1",
			[2] = "AnhÙlµÙ§éc",
			[3] = 4502403
		},
		[2]={
			[1] = "vietol3",
			[2] = "TrumDoc",
			[3] = 21372503
		},
		[3]={
			[1] = "raypu1993",
			[2] = "ÙRÇyÙCÇnÙSa",
			[3] = 21372503
		}
	},
	[4]={
		[1]={
			[1] = "quangsonmoi1",
			[2] = "R¾nÙHæÙChóa",
			[3] = 19022603
		},
		[2]={
			[1] = "binhminh2014",
			[2] = "BèÙ§êi",
			[3] = 7182703
		},
		[3]={
			[1] = "hackvolam",
			[2] = "VuaPhaHoai",
			[3] = 8482703
		}
	},
	[5]={
		[1]={
			[1] = "sinhvienvietnam",
			[2] = "oOoÙTranTranÙoOo",
			[3] = 12042403
		},
		[2]={
			[1] = "vtv10bd1",
			[2] = "Ph¹mÙYÕnÙNhi",
			[3] = 17592403
		},
		[3]={
			[1] = "bangma2",
			[2] = "••Ä.B¨ngÙThÇn••",
			[3] = 18122503
		}
	},
	[6]={
		[1]={
			[1] = "kaiyin102",
			[2] = "TiÓuÙS¶nh",
			[3] = 8072403
		},
		[2]={
			[1] = "kaiyin103",
			[2] = "TiÓuÙMÉn",
			[3] = 8572403
		},
		[3]={
			[1] = "hunghong1",
			[2] = "HNÙLinhNhi",
			[3] = 17242503
		}
	},
	[7]={
		[1]={
			[1] = "thichcuunet90",
			[2] = "…Long•Thiªn•Phó…",
			[3] = 7542503
		},
		[2]={
			[1] = "xuanhao001",
			[2] = "ÙD­¬ngÙHµo",
			[3] = 4142703
		},
		[3]={
			[1] = "tunglaw304",
			[2] = "PBÙ...Bi...",
			[3] = 23002703
		}
	},
	[8]={
		[1]={
			[1] = "vtv10bd2",
			[2] = "L·oÙCöu",
			[3] = 362403
		},
		[2]={
			[1] = "kiemmaxx1",
			[2] = "ThiªnMinh",
			[3] = 10072503
		},
		[3]={
			[1] = "chamkaka",
			[2] = ".• TriÖu V©n •.",
			[3] = 16022503
		}
	},
	[9]={
		[1]={
			[1] = "kaiyin101",
			[2] = "Tr­¬ngÙTamÙPhong",
			[3] = 7222403
		},
		[2]={
			[1] = "annhauvt1",
			[2] = "$LoiThan$",
			[3] = 482703
		},
		[3]={
			[1] = "tehatquy01",
			[2] = "ObiÙHq13",
			[3] = 6542703
		}
	},
	[10]={
		[1]={
			[1] = "bangma",
			[2] = "••Ä.L«iÙThÇn.••",
			[3] = 7462503
		},
		[2]={
			[1] = "hoangmeo5",
			[2] = "-1993-",
			[3] = 21352503
		},
		[3]={
			[1] = "cnvt02",
			[2] = "CócÙNhËt",
			[3] = 21592603
		}
	}
}