TOP_CT={
	[1]={
		[1] = "adphuchung",
		[2] = "adasds",
		[3] = 21481303
	},
	[2]={
		[1] = "phuochau3",
		[2] = "dsadsa",
		[3] = 21481303
	},
	[3]={
		[1] = "phuochau",
		[2] = "dsadsa",
		[3] = 23241303
	},
	[4]={
		[1] = "phuochau1",
		[2] = "dsadas",
		[3] = 91403
	},
	[5]={
		[1] = "minhthuong36",
		[2] = "Huycld",
		[3] = 2371403
	},
	[6]={
		[1] = "manhkha",
		[2] = "l·ngTöV«T×nh",
		[3] = 3191403
	},
	[7]={
		[1] = "phuochau00",
		[2] = "dddddddddddddddd",
		[3] = 6371403
	},
	[8]={
		[1] = "phuochau00",
		[2] = "Huyyyzz",
		[3] = 7231403
	},
	[9]={
		[1] = "minhthuong32",
		[2] = "Huyyyyyyyy",
		[3] = 7571403
	},
	[10]={
		[1] = "quanghuy1",
		[2] = "do·ntrÝb×nh",
		[3] = 8381403
	},
	[11]={
		[1] = "manhkha2",
		[2] = "TestDuaTop",
		[3] = 0
	},
	[12]={
		[1] = "tanthanhhoa13",
		[2] = "DAmeCChinh",
		[3] = 12541403
	},
	[13]={
		[1] = "quanghuy3",
		[2] = "cÈutÆc",
		[3] = 13341403
	},
	[14]={
		[1] = "chriskyle91",
		[2] = "Tanker2018",
		[3] = 14441403
	},
	[15]={
		[1] = "chriskyle2",
		[2] = "Assassin",
		[3] = 14561403
	},
	[16]={
		[1] = "tuan7163815",
		[2] = "TuÊnÙBåÙ§µ",
		[3] = 15191403
	},
	[17]={
		[1] = "huutai776",
		[2] = "Tr­¬ngÙTam",
		[3] = 16201403
	},
	[18]={
		[1] = "hoahoctro80",
		[2] = "Mr.SssDaossS.",
		[3] = 16381403
	},
	[19]={
		[1] = "onelove2dn",
		[2] = "Gi¸o˜Chñ˜",
		[3] = 18121403
	},
	[20]={
		[1] = "onelove4dn",
		[2] = "The˜King",
		[3] = 18121403
	},
	[21]={
		[1] = "chriskyle4",
		[2] = "DRAGON",
		[3] = 18171403
	},
	[22]={
		[1] = "tanthanhhoa15",
		[2] = "T×nhMét§ªm",
		[3] = 21041403
	},
	[23]={
		[1] = "baobao190190",
		[2] = "TNLTVT",
		[3] = 22121403
	},
	[24]={
		[1] = "huutai001",
		[2] = "BPÙÙBoÙBoÙÙ",
		[3] = 23421403
	},
	[25]={
		[1] = "nguyenductuan",
		[2] = "D­ÙÙNguyÔn",
		[3] = 171503
	},
	[26]={
		[1] = "tanthanhhoa15",
		[2] = "ConDi~",
		[3] = 411503
	},
	[27]={
		[1] = "baobao190190",
		[2] = "ksbaichoi",
		[3] = 6461503
	},
	[28]={
		[1] = "ut1991",
		[2] = "littlebird91",
		[3] = 7001503
	},
	[29]={
		[1] = "quanghuy2",
		[2] = "longc«n­¬ng",
		[3] = 9401503
	},
	[30]={
		[1] = "ut1992",
		[2] = "ut'1991",
		[3] = 12181503
	},
	[31]={
		[1] = "goodboy",
		[2] = "GoodŽBoy",
		[3] = 14431503
	},
	[32]={
		[1] = "hungpentasi1",
		[2] = "•CËuÙBÐÙTuæiÙGµ•",
		[3] = 15451503
	},
	[33]={
		[1] = "vanhuy11",
		[2] = "VanÙAnh",
		[3] = 17211503
	},
	[34]={
		[1] = "ngocdungtiti",
		[2] = "NgäcÙDòng",
		[3] = 17431503
	},
	[35]={
		[1] = "chohackday",
		[2] = "§¹iT­íng",
		[3] = 18101503
	},
	[36]={
		[1] = "c814964",
		[2] = "ThapTamMui",
		[3] = 20311503
	},
	[37]={
		[1] = "topkute09",
		[2] = "PhongThanhDuong",
		[3] = 21411503
	},
	[38]={
		[1] = "baobao191919",
		[2] = "ksnhieughe",
		[3] = 21571503
	},
	[39]={
		[1] = "vidolaemgame12",
		[2] = "ThèngLÜnh",
		[3] = 22141503
	},
	[40]={
		[1] = "vidolaemgame123",
		[2] = "ThèngT­íng",
		[3] = 22171503
	},
	[41]={
		[1] = "caytop1dn",
		[2] = "L·o˜§¹i",
		[3] = 23291503
	},
	[42]={
		[1] = "raypu011",
		[2] = "fsafsafasfa",
		[3] = 1021603
	},
	[43]={
		[1] = "raypu012",
		[2] = "gfdgdfgdf",
		[3] = 1051603
	},
	[44]={
		[1] = "quannguyen1210",
		[2] = "[ATVV]hai0muoi8",
		[3] = 9101603
	},
	[45]={
		[1] = "hungpentasi2",
		[2] = "Ù•C«ÙBÐÙ1m5•Ù",
		[3] = 10041603
	},
	[46]={
		[1] = "raypu015",
		[2] = "ccccccccccccc",
		[3] = 11371603
	},
	[47]={
		[1] = "mthu0ng31",
		[2] = "Huyyyyyyyyyy",
		[3] = 17181603
	},
	[48]={
		[1] = "topkute06",
		[2] = "PhaÙThien",
		[3] = 19291603
	},
	[49]={
		[1] = "topkute08",
		[2] = "PeÙHeo",
		[3] = 19351603
	},
	[50]={
		[1] = "dangthanhhai1988",
		[2] = "DarkÙKnight",
		[3] = 20001603
	}
}